[
  {
    "id": "54164822-a461-11e7-9b4f-986dc6f6a72a",
    "created_at": "Fri Sep 29 07:14:19 UTC 2017",
    "title": "Frontend-utvecklare som vill revolutionera marknaden för videodistribution",
    "location": "Stockholm",
    "type": "Full Time",
    "description": "<p><b>JOBBESKRIVNING</b></p>\n\n<p>Vill du sluta koda tråkiga formulär och hemsidor? Vill du jobba med gränssnitt som de ser ut på film? Är du lika sugen på att jobba med användarcentrerad datadriven design som med interaktiva kartbaserade applikationer? Läs vidare! Med den här tjänsten kommer du in på en dynamisk internationell startup med några av världens största varumärken som kunder. Hive Streamings vision är att transformera videodistributionsmarknaden och här behöver vi din hjälp!</p>\n\n<p><b>OM TJÄNSTEN</b></p>\n\n<p>Academic Work söker för Hive Streamings räkning en frontendutvecklare som lockas av att arbeta med de senaste ramverken för gränssnittsprogrammering. Hive Streaming leverar en mjukvarutjänst för videodistribution som möjliggör användandet av video för företag i tätt samarbete med partners som Microsoft (Skype for Business) och andra stora spelare på videomarknaden. Vill du arbeta med fullstack-utveckling i en organisation där du får jobba i teknikens framkant är det hit du ska söka dig! Hive Streaming arbetar med några av världens största varumärken och arbetsmiljön präglas av entreprenörskap.</p>\n\n<p>Den här rekryteringsprocessen hanteras av Academic Work och Hive Streamings önskemål är att alla samtal och mail kring tjänsten går till Academic Work.</p>\n\n<p>Tjänsten är en direktrekrytering vilket innebär att rekryteringsprocessen sker genom Academic Work men du kommer anställas direkt hos Hive Streaming.</p>\n\n<p><b>ARBETSUPPGIFTER</b></p>\n\n<p>Som frontendutvecklare kommer du att arbeta med de gränssnitt som omger Hives avancerade grundteknologier. Du kommer att vara delaktig i utvecklingen av nästa generations webb-baserade verktyg i de videodistributionslösningar som Hive Streaming erbjuder till sina kunder. Verktygen används för en mängd olika ändamål i de egenutvecklade programmen, exempelvis för administration, övervakning och statistik. Du kommer att arbeta med de senaste teknikerna inom webbutveckling med t.ex Typescript och Angular.js. För visualisering kommer du att arbeta i d3.js.</p>\n\n<p>Du kommer till exempel att:</p>\n\n<ul>\n<li>Arbeta med systemutveckling i JavaScript, HTML och CSS</li>\n<li>Vara delaktig i arbetet för användbarhet och UX</li>\n</ul><p>Tjänsten passar dig som har ett stort intresse för systemutveckling och för att utforska de nya teknikerna. Du är tekniskt lagd, nyfiken och en stor vilja av att utvecklas inom området. Vi söker både dig som är nyexaminerad från en eftergymnasial utbildning inom systemutveckling/datateknik eller dig med ett par års erfarenhet. Det viktigaste är ditt driv och ditt intresse.</p>\n\n<p><b>VI SÖKER DIG SOM</b></p>\n\n<ul>\n<li>Har en naturlig fallenhet och en stor passion för webb- och systemutveckling</li>\n<li>Har goda kunskaper i JavaScript, HTML och CSS. Dessa har du fått genom studier och egna projekt och eventuellt också genom något tidigare arbete. Du har projekt/portfolio att visa upp</li>\n<li>Har en eftergymnasial utbildning exempelvis inom datateknik, systemutveckling eller motsvarande</li>\n<li>Har grundläggande kunskaper i både Windows och Linux</li>\n<li>Har mycket goda kunskaper i engelska eftersom det är arbetsspråket</li>\n</ul><p>Det är meriterande om du:</p>\n\n<ul>\n<li>Arbetat i något JavaScript-ramverk som AngularJS eller liknande</li>\n<li>Har kunskaper i Typescript</li>\n<li>Har erfarenhet av Ruby on Rails</li>\n<li>Har en förståelse för http-baserad streaming-teknik</li>\n</ul><p>Som person är du flexibel och trivs med att arbeta i en agil och föränderlig miljö. Du kan skifta fokus och prioritera om. Vidare är du självgående, driven och har förmågan att själv driva och ansvara för att dina arbetsuppgifter utförs med god kvalitet och till utsatt deadline.</p>\n\n<p><b>ÖVRIG INFORMATION</b></p>\n\n<ul>\n<li>Start: Snarast enligt överenskommelse</li>\n<li> Omfattning: Heltid</li>\n<li>Lön: Månadslön enligt överenskommelse</li>\n<li>Placering: Södermalm, centrala Stockholm</li>\n<li>Kontaktuppgifter: Jenny Rydberg, rekryteringskonsult, recruitmentstockholmsouth@academicwork.se.</li>\n</ul><p>Academic Work är Home of the Young Professionals. Vi vänder oss till dig som är akademiker och fortfarande studerar på högskola/universitet, är nyutexaminerad eller har några års arbetslivserfarenhet. Hos oss kan du arbeta som uthyrd konsult på specifika kunduppdrag eller bli anställd direkt hos ett kundföretag via vår rekryteringsverksamhet. Läs mer på <a href=\"http://www.academicwork.se\">www.academicwork.se</a>.</p>\n\n<p>SKYDD FÖR DEN PERSONLIGA INTEGRITETEN När du skickar in din ansökan till Academic Work godkänner och samtycker du till att Academic Work behandlar dina personuppgifter enligt Personuppgiftslagen. Läs mer under vår PuL-sida.</p>",
    "how_to_apply": "<p>Sök tjänsten genom att klicka på länk nedan:\n<a href=\"https://www.academicwork.se/annons/frontend-utvecklare-som-vill-vara-med-och-revolutionera-marknaden-for-videodistribution/14994246\">https://www.academicwork.se/annons/frontend-utvecklare-som-vill-vara-med-och-revolutionera-marknaden-for-videodistribution/14994246</a></p>\n\n<p>Vi går igenom urvalet löpande och annonsen kan stängas ner innan tjänsten är tillsatt om vi gått över till urvals och intervjufasen.</p>\n\n<p>Vi tar inte emot ansökningar via mail men har du specifika frågor kring tjänsten besvaras dessa på recruitmentstockholmsouth@academicwork.se. under kontorstid. Skriv annonstiteln i rubriken och kopiera gärna in länken till annonsen i ditt mail. För generella funderingar kring din ansökan/vår rekryteringsprocess finns vi ofta tillgängliga i chatten här på webben under vardagar så hör gärna av dig där!</p>",
    "company": "Hive Streamings",
    "company_url": "https://www.hivestreaming.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/374d2ff8-a461-11e7-97ff-03ac07a79b07.png",
    "url": "http://jobs.github.com/positions/54164822-a461-11e7-9b4f-986dc6f6a72a"
  },
  {
    "id": "f399f24a-a47f-11e7-9ea5-c96489d2e696",
    "created_at": "Thu Sep 28 19:05:36 UTC 2017",
    "title": "Senior Android Engineer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<h2>Job Description</h2>\n\n<p>We are looking for an Android developer responsible for the development and maintenance of applications aimed at a vast number of diverse Android devices and geographies. Your primary focus will be the development of Android applications and their integration with back-end services. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, commitment to collaborative problem solving, sophisticated design, and creating quality products is essential.</p>\n\n<h2>Skills &amp; Qualifications</h2>\n\n<ul>\n<li>3 or more years experience building sophisticated Android apps</li>\n<li>Strong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizes</li>\n<li>Familiarity with RESTful APIs to connect Android applications to backend services</li>\n<li>Strong knowledge of Android UI design principles, patterns, and best practices</li>\n<li>Experience with offline storage, threading, and performance tuning</li>\n<li>Ability to design applications around natural user interfaces, such as “touch”</li>\n<li>Familiarity with the use of additional sensors, such as gyroscopes and accelerometers</li>\n<li>Knowledge of the open-source Android ecosystem and the libraries available for common tasks</li>\n<li>Ability to understand business requirements and translate them into technical requirements</li>\n<li>Familiarity with cloud message APIs and push notifications</li>\n<li>A knack for benchmarking and optimization</li>\n<li>Understanding of Google’s Android design principles and interface guidelines</li>\n<li>Proficient understanding of code versioning tools, such as Git</li>\n<li>Familiarity with continuous integration</li>\n</ul>",
    "how_to_apply": "<p><a href=\"mailto:hiring@vidy.com\">hiring@vidy.com</a></p>",
    "company": "VIDY, Inc",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/f0451c00-a47f-11e7-8da6-1eeaf2a2efa7.png",
    "url": "http://jobs.github.com/positions/f399f24a-a47f-11e7-9ea5-c96489d2e696"
  },
  {
    "id": "baafa25e-a47f-11e7-8053-54dbdd3a0038",
    "created_at": "Thu Sep 28 19:04:01 UTC 2017",
    "title": "Senior iOS Engineer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<h2>Job Description</h2>\n\n<p>We are looking for an iOS developer responsible for the development and maintenance of applications aimed at iOS devices including mobile phones and tablets. Your primary focus will be development of iOS applications and their integration with backend services. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.</p>\n\n<h2>Skills &amp; Qualifications</h2>\n\n<ul>\n<li>3 or more years of professional experience building sophisticated iOS apps in Objective-C and Swift (latest)</li>\n<li>Extensive experience building custom views and layouts</li>\n<li>Extensive experience with iOS Frameworks (AVFoundation including custom A/V capture, SFSpeechRecognizer, NSURLSession, Photos, etc)</li>\n<li>Extensive experience with Social Network SDKs (Facebook, Twitter, WeChat, etc)</li>\n<li>Experience with custom iOS Extensions (Keyboard, iMessage, Share, etc)</li>\n<li>Experience with mobile databases (Realm), threading (GCD), and performance optimization (Instruments)</li>\n<li>Experience with Xcode target configuration (.xcconfig)</li>\n<li>Experience with Objective-C and Swift interoperability</li>\n<li>Experience with Localization</li>\n<li>Experience with TDD</li>\n<li>Familiarity with RESTful APIs and connecting iOS applications to backend services</li>\n<li>Familiarity with C, C++ and OOP</li>\n<li>Familiarity with push notifications (UNUserNotificationCenter)</li>\n<li>Familiarity with fastlane deployment</li>\n<li>Understanding of Apple’s design principles and interface guidelines</li>\n<li>Attention to detail with respect to software design and architecture</li>\n<li>Proficient understanding of code versioning tools such as Git</li>\n</ul>",
    "how_to_apply": "<p><a href=\"mailto:hiring@vidy.com\">hiring@vidy.com</a></p>",
    "company": "VIDY, Inc",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/b788bce6-a47f-11e7-83c7-74a227d0b4fb.png",
    "url": "http://jobs.github.com/positions/baafa25e-a47f-11e7-8053-54dbdd3a0038"
  },
  {
    "id": "206a9866-a47f-11e7-9f19-8b4397ebba30",
    "created_at": "Thu Sep 28 18:59:46 UTC 2017",
    "title": "Head of Design",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<h2>Job Description</h2>\n\n<p>At VIDY we apply design as a calculated practice - human centered and data inspired.</p>\n\n<p>As our Head of Design, you will work closely with the entire product team and will define our design process, tooling, and delivery system with an accent on iterative and data driven decision making.</p>\n\n<p>Your primary goals will be to design and manage the development of the next generation of mobile websites, apps, keyboards, APIs and other interfaces across multiple platforms such as iOS, Android and mobile web.</p>\n\n<p>We expect you to have an evolved understanding of how people use their devices, the flexibility to adapt to new technologies, and a robust toolkit.</p>\n\n<p>You will be reporting to and strategizing with the CEO and engineering stakeholders within the company to determine and execute long-term product goals.</p>\n\n<p>Day-to-day, you will manage a team of two designers and lead the design team to execute on your vision. You will be responsible for highly usable and intuitive interface creation. Any concept you create will be brand-consistent across all mobile experiences that our company provides to our end users.</p>\n\n<h2>Skills &amp; Qualifications</h2>\n\n<ul>\n<li>Strong graphic design skills, with a good understanding of typography, intuitive layouts, and color theory.</li>\n<li>Excellent understanding of user-experience design for mobile and the web, technology trends, Apple’s human interface design guidelines, Android design, demonstrable design skills, and ability to show relevant work</li>\n<li>Proven ability to quickly deliver high quality designs to the team at large and our in-house design team</li>\n<li>A team player who can easily adapt in a rapidly changing environment</li>\n<li>Experience in designing high quality consumer websites, apps and digital products with a background in bringing ideas from conception through to market adoption with design.</li>\n</ul>",
    "how_to_apply": "<p><a href=\"mailto:hiring@vidy.com\">hiring@vidy.com</a></p>",
    "company": "VIDY, Inc",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/1c8a95fc-a47f-11e7-87fd-dd4db8405973.png",
    "url": "http://jobs.github.com/positions/206a9866-a47f-11e7-9f19-8b4397ebba30"
  },
  {
    "id": "d3aebf16-a47e-11e7-9c65-3b9a172bd368",
    "created_at": "Thu Sep 28 18:57:31 UTC 2017",
    "title": "Mid Customer Success Engineer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<h2>Job Description</h2>\n\n<p>As Customer Success Engineer you will be the face and voice of the company at conferences, meetings with potential partners and a point of reference for existing ones.</p>\n\n<p>Your goal will be to make our customers successfull integrating our APIs in their products, helping them writing code, sending examples, documentation, answering question they might have.</p>\n\n<p>You will be pro-active in writing our documentation and knowledge base and keeping up to date with new features and releases.</p>\n\n<h2>Skills &amp; Qualifications</h2>\n\n<ul>\n<li>Experience with multiple languages, JavaScript, Python, PHP, Objective-C</li>\n<li>Experience with implementing code following specs and documentation</li>\n<li>Bonus: Fluent in Chinese</li>\n<li>Bonus: Experience with working with Chinese Customers</li>\n<li>Bonus: 2+y of experience as customer success engineer</li>\n</ul>",
    "how_to_apply": "<p><a href=\"mailto:hiring@vidy.com\">hiring@vidy.com</a></p>",
    "company": "VIDY, Inc",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/cc57a1ba-a47e-11e7-9d0e-7695f47a0eff.png",
    "url": "http://jobs.github.com/positions/d3aebf16-a47e-11e7-9c65-3b9a172bd368"
  },
  {
    "id": "86ff5478-a47e-11e7-9d91-b354d5e3f2d6",
    "created_at": "Thu Sep 28 18:55:27 UTC 2017",
    "title": "Senior Data Engineer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<h2>Job Description</h2>\n\n<p>We are looking for a Data Engineer that will help us discover the information hidden in vast amounts of user data, and help us make smarter decisions to deliver even better products.</p>\n\n<p>Your primary focus will be in applying data mining techniques, doing statistical analysis, and building high quality prediction systems integrated with our products as well as developing internal A/B testing procedures to continually test and improve our products.</p>\n\n<p>As a data engineer, you will be in charge of data ingestion (events), periodic dumps from different databases and all the automation and tooling. VIDY is built on top of a 100% Cloud Native infrastructure, all data processing and extraction runs in a container and at large scale.</p>\n\n<p>Part of your responsibilities will be setting up daily, weekly, and monthly reports containing all the answers the engineering and product team need.</p>\n\n<p>The ultimate goal is to have enough automation to go from question to answer in few minutes, presented in a way that is clean and easy to understand for everybody.</p>\n\n<h2>Skills &amp; Qualifications</h2>\n\n<ul>\n<li>You need to fluently speak Math</li>\n<li>Two or more years of experience with big data</li>\n<li>Experience with Google Cloud services including BigQuery</li>\n<li>Experience with multiple databases like MongoDb, redis, MySQL etc</li>\n<li>Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.</li>\n<li>Experience with Cloud Native technologies, containers and the docker ecosystem</li>\n<li>Experience with open source software</li>\n<li>Experience with git and git workflows connected to CI/CD</li>\n<li>Experience with github, pull requests and code review</li>\n<li>Bonus: Experience with Node.js</li>\n<li>Bonus: Experience with Go</li>\n<li>Bonus: Experience with Tensorflow</li>\n</ul>",
    "how_to_apply": "<p><a href=\"mailto:hiring@vidy.com\">hiring@vidy.com</a></p>",
    "company": "VIDY, Inc",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/839077fe-a47e-11e7-9573-63fe532acd50.png",
    "url": "http://jobs.github.com/positions/86ff5478-a47e-11e7-9d91-b354d5e3f2d6"
  },
  {
    "id": "05a44492-a47e-11e7-9e48-b91b052b5c9e",
    "created_at": "Thu Sep 28 18:53:00 UTC 2017",
    "title": "Senior Front-end Engineer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<h2>Job Description</h2>\n\n<p>We are looking for a Front-End Web Developer who is motivated to combine the art of design with the art of programming. Responsibilities will include translation of the UI/UX design wireframes to production cross-browser code that delivers a near-native experience to our users. You will work with the Head of Design and bridge the gap between graphical design and technical implementation, taking an active role on both sides and defining how our website (desktop and mobile) and internal dashboard look and function.</p>\n\n<p>Our front-end code utilizes the latest in build tools to ship highly optimized code to our users. You will get the chance to work with the latest HTML5 APIs such as Media Capture and Service Workers while still progressively supporting browsers that don’t support such APIs. This is your chance to be one of the industry leaders when it comes to delivering video on the web.</p>\n\n<h2>Skills &amp; Qualifications</h2>\n\n<ul>\n<li>Three or more years experience as a senior front-end engineer</li>\n<li>Proficient understanding of web markup, including HTML5, CSS3</li>\n<li>Solid understanding of the DOM and its underlying APIs</li>\n<li>Good understanding of advanced JavaScript libraries and frameworks, such as Angular, Vue, and React.</li>\n<li>Familiarity with progressive web application principles</li>\n<li>Familiarity with progressive enhancement principles</li>\n<li>Basic knowledge of image authoring tools, to be able to prepare assets for web use</li>\n<li>Familiarity with tools such as as Sketch, Gimp, or Photoshop is a plus</li>\n<li>Experience working with video on the web is a big plus</li>\n<li>Proficient understanding of cross-browser compatibility issues and ways to work around them</li>\n<li>Proficient understanding of code versioning tools, such as Git</li>\n<li>Strong understanding of SEO principles and ensuring that application will adhere to them</li>\n</ul>",
    "how_to_apply": "<p><a href=\"mailto:hiring@vidy.com\">hiring@vidy.com</a></p>",
    "company": "VIDY, Inc",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/ef56910e-a47d-11e7-949a-fe241f58008a.png",
    "url": "http://jobs.github.com/positions/05a44492-a47e-11e7-9e48-b91b052b5c9e"
  },
  {
    "id": "9f7d6554-a47d-11e7-8965-5a312bcb7f41",
    "created_at": "Thu Sep 28 18:49:11 UTC 2017",
    "title": "Mid Back-end Engineer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<h2>Job Description</h2>\n\n<p>As a Backend engineer, you will be both maintaining current features and implementing new ones.</p>\n\n<p>You will be working on a highly automated environment with test suites and CI/CD that is 100% Cloud Native.</p>\n\n<p>You will be working with Containers and Kubernetes in a large scale distributed system with peaks of 25,000 CPUs running simultaneously. Our designs need to survive billions of API calls keeping the response time below 50ms.</p>\n\n<p>You will have the chance to reach millions of users with your code and face challenges that only few companies have the luxury to have.</p>\n\n<p>A large chunk of our code base is written in Node.js, up to date to the latest release available on a monthly basis. You will be writing modern JavaScript with no callbacks and only promises async/await.</p>\n\n<h2>Skills &amp; Qualifications</h2>\n\n<ul>\n<li>Two plus years of experience with Node.js and modern JavaScript</li>\n<li>Strong Experience working with unix like machines</li>\n<li>Strong Experience with writing test suites and testable code</li>\n<li>Strong Experience with writing open source modules and github</li>\n<li>Strong Experience with git workflows, PR, code review</li>\n<li>Medium Experience with system design and microservices infrastructure</li>\n<li>Medium Experience with Docker, Containers, and Docker compose workflows</li>\n<li>Medium Experience with MongoDb, Redis, Elasticsearch</li>\n<li>Bonus: Knowledge of Domain Driven Design</li>\n<li>Bonus: Knowledge of Idempotency patterns when working with data and eventual consistency</li>\n</ul>",
    "how_to_apply": "<p><a href=\"mailto:hiring@vidy.com\">hiring@vidy.com</a></p>",
    "company": "VIDY, Inc",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/92f23b7a-a47d-11e7-9caf-1398cb0c766e.png",
    "url": "http://jobs.github.com/positions/9f7d6554-a47d-11e7-8965-5a312bcb7f41"
  },
  {
    "id": "db47445e-a470-11e7-8c65-5cd0c11a6058",
    "created_at": "Thu Sep 28 17:17:08 UTC 2017",
    "title": "Senior Software Engineer, Core Services Platform",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>Are you a techie with a passion for software? Are you excited at the prospect of building expertise in mobile advertising and its technology stack? If so, we’d like to talk to you!</p>\n\n<p>At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in Search Ads in App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy.</p>\n\n<p>We are seeking an experienced software architect/senior engineer who is passionate about creating high-performing, scalable, well-designed back-end systems that are the foundation for critical internal and customer-facing platforms at Apple. As a senior developer you will take ownership of a solution from beginning to end and deliver great software to help drive usage and monetization within Apple News and other platforms.</p>\n\n<p>The Core Services Platform team designs and builds best of breed systems for dealing with our complex and ever-growing data and infrastructure needs that deliver advertising data to Ad Server and Big Data pipelines. The team is directly responsible for systems that are used by thousands of advertisers, publishers and developers and has high visibility in the mobile advertising space.</p>\n\n<p>Key Qualifications:</p>\n\n<ul>\n<li>5 or more years of industry experience in server-side Java programming (working in large-scale systems a plus)</li>\n<li>Experience in designing and implementing RESTful APIs </li>\n<li>Experience and deep understanding of scalable distributed systems like Cassandra, Solr, Kafka and/or Hadoop</li>\n<li>Demonstrated experience architecting, developing and deploying internet-scale, distributed and mission critical services</li>\n<li>Experience working on complex problems and systems where scalability and performance are extremely important (every millisecond counts)</li>\n<li>Experience with Spring/Hibernate is desirable</li>\n<li>Relational database experience and demonstrated abilities in SQL and data modeling is required. Proficiency with NoSQL databases is desired as well</li>\n<li>Strong problem solving and debugging skills are required</li>\n<li>Ability to communicate effectively, both written and verbal, with technical and non-technical cross-functional teams</li>\n<li>Results oriented and deadline driven</li>\n<li>A desire to work in a fast-paced and challenging work environment</li>\n<li>Prior experience in advertising industry is a huge plus</li>\n</ul><p>Description:\nCore Services Platform team encapsulates the entire data model, and provides an abstraction layer upon which all other parts of the platform are built. We are the glue between a number of teams within Ad Platforms and also integrate with other software teams around the company. </p>\n\n<p>As a key contributor to this team, you will design and develop secure and scalable back-end systems that deliver key business data to ad servers and big data pipelines. You will build and maintain interfaces used by both internal systems and thousands of developers and advertisers world-wide.</p>\n\n<p>We are looking for engineer who is self-motivated, has great design instincts, and enjoys working cross-functionally. The right candidate will enjoy high-performing, elegant systems from the ground up, in close partnerships with various teams around you. He or she will also possess keen judgement in selecting technologies and building the right solution for the interesting challenges we get to solve here.</p>\n\n<p>Education:\nBachelor's degree in Computer Science or equivalent is required\nMaster's degree preferred</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=95a6935444c1d4552664c971a47b3f61\">https://ars2.equest.com/?response_id=95a6935444c1d4552664c971a47b3f61</a>\nREQUISITION NUMBER: 112915777</p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/c09ee12a-a470-11e7-8f6c-8be7570def7b.jpeg",
    "url": "http://jobs.github.com/positions/db47445e-a470-11e7-8c65-5cd0c11a6058"
  },
  {
    "id": "bdd8ffb6-a3e4-11e7-976f-82d34c46edca",
    "created_at": "Thu Sep 28 00:35:51 UTC 2017",
    "title": "Principal UX Designer",
    "location": "Irvine, CA",
    "type": "Full Time",
    "description": "<p>Ever wanted to be part of a tech-startup from the ground up? A new ADVENTURE where you're among the first 100 employees at a FULLY funded startup developing NEW, never before offered WORLD CLASS cloud video solutions that'll GLOBALLY change video tech forever? Your opportunity is here! We're diligently preparing for our PRODUCT LAUNCH and we're looking for deeply experienced PRINCIPAL UX DESIGNER who's NOT just looking for a new \"job,\" but instead seeks to MAKE HISTORY by passionately developing new products that'll change entire industries and the use of video technologies around the world!\nIf you're ready and selected, we offer much of the standard perks that startups offer, such as an amazing open workspace, along with relocations (2 months free apartment if hired), visa services (after one year), 10 day hiring process if hired, and sign-on bonuses!\nJob purpose\nUnderstand customer &amp; partner needs to re-invent &amp; cloud services that are the most powerful, intuitive and compelling interactions in the industry.</p>\n\n<p>Primary Responsibilities</p>\n\n<ul>\n<li>Based on the market input, be the voice of the customers (servant leader) in the fast-paced agile process consisting of several autonomous product development teams. Ensure maximum customer value creation through groundbreaking user experience and visual design.</li>\n<li>Influence product managers, software architects, developers and other disciplines to broaden and strengthen UX understanding and importance.</li>\n<li>Translate business objectives and customer needs into exceptional user &amp; partner experience.</li>\n<li>Responsible to all UX activities spanning the entire design and development process, from early requirements gathering to final fit-and-finish review.</li>\n<li>Translate the business strategy to execution delivering innovate user experience designs, addressing customer and end-user needs.\nJob tasks</li>\n<li>Visiting customers, interviewing end-users and observing them performing daily tasks, create UX resources such as different flows, blueprints, and interactive prototypes.</li>\n<li>Produce, design documents that explain your design to clients and developers participating in user testing sessions and interviewing customers with relevant skills and responsibilities.</li>\n<li>Evangelize and demonstrate best practices in heuristics, usability and user-centric design.</li>\n<li>Translate business objectives and user needs into exceptional user experiences.</li>\n<li>Identify and plan the user experience research needed to meet the strategic business and product goals.</li>\n<li>Visit customers and end-users to understand their goals and current pain points</li>\n<li>Share insights from field studies and surveys with internal stakeholders</li>\n<li>Create UX deliverable's including; customer ecosystem models, personas and end-user scenarios, interaction models, blueprints, consumer journey maps, annotated wireframes describing interactions of components, details regarding priority and states (Primary, Secondary, Disabled, Enabled) of controls, wire flows showing pages transitions, pages respond to changes in browser width, contents and default values of drop-downs and other controls, default page presentation, mapping of personas to menus/features/functionality, HTML/CSS representations of controls, PNG/SVG representations of visual artifacts, color palette &amp; fonts (type, color, size), brand style guide - all based on user data driven decisions.</li>\n</ul><p>Job Description</p>\n\n<ul>\n<li>Ensure design goals are aligned with end-user needs through focus groups, usability tests, card sorting A/B tests or other user research methods for validation.</li>\n<li>Validate that release goals are meet via usability and benchmark studies through global early adopter programs</li>\n<li>Research and monitor current trends and best practices related to user interaction and experience design.\nProfessional qualifications</li>\n<li>Extensive experience working with usability and user-centered design in a software company.</li>\n<li>Master education within human factors, psychology, design, or a related field (PHD preferred)</li>\n<li>8+ years of experience with UX research for software products or services, preferably with enterprise solutions and new product/service development, assessment, and launch.</li>\n<li>A track record of strongly influencing product and service designs and directions based on end-user needs (an extensive portfolio is required containing both interaction design, as well as visual design examples).</li>\n<li>Track recordi of designing end-to-end SaaS experiences using user-centered design and Agile UX methodologies.</li>\n<li>Experience with and thorough understanding of fundamental usability methods like contextual inquiry, heuristic evaluations, cognitive walkthrough, user surveys and usability tests</li>\n<li>Experience with organizing and sharing end-user insights via customer models and persona descriptions</li>\n<li>Experience using UX tools to craft conceppting strategies and deliverable's.\nPersonal skills</li>\n<li>Team player with energy, humor, and creativity that shares the Arcus Global passion for what great design and technology can do for our customers.</li>\n<li>Committed to excellence and independent with excellent collaboration skills</li>\n<li>An expert listener - continous self improver and works by soliciting, responding to, and incorporating feedback on how things can be better regardless of internal or external seniority level.</li>\n<li>Effective at communicating and skilled at presenting and selling creative ideas to partners and internal teams.</li>\n<li>Self-motivated and able to plan and drive own tasks</li>\n<li>Possess great communication skills, technical knowledge, and connects easily with others.</li>\n<li>Able to rapidly develop artifacts to help communicate with others and gain support.</li>\n<li>Results driven and able to drivel insights, shared with the design and development teams</li>\n<li>Develops solutions to ensure that the end user’s goals are reflected in the product or service design.</li>\n<li>Passionate about great user-centered design, technology, and emerging UX practices and tools</li>\n<li>Has a positive mindset and are able to share knowledge with other disciplines</li>\n<li>Works great in teams and possess good interpersonal skills</li>\n<li>Self-assured, driven, confident and goal-oriented – set clear directions without dictating the technical solution.</li>\n<li>Ability to effectively delegate and translate needs into daily routine operations</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Strong technical, mathematics, and analytical skills.</li>\n<li>Solves problems effectively - sees innovation opportunities in everything</li>\n<li>Strong negotiation skills, applicable for both engineering and GTM teams</li>\n<li>Strong operational execution with ability to build and manage cross-group, cross-cultural relationships</li>\n<li>Partner effectively with other Canon Group and Milestone teams\nJob Type: Full-time</li>\n</ul>",
    "how_to_apply": "<p><a href=\"mailto:HR@arcusnext.com\">HR@arcusnext.com</a></p>",
    "company": "Arcus Global, Inc",
    "company_url": "http://arcusnext.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/bdd8ffb6-a3e4-11e7-976f-82d34c46edca"
  },
  {
    "id": "6eb7498a-a3ba-11e7-83bc-14241500d139",
    "created_at": "Wed Sep 27 19:31:57 UTC 2017",
    "title": "Software Engineer, Geospatial Insights",
    "location": "Philadelphia",
    "type": "Full Time",
    "description": "<p>Overview</p>\n\n<p>Azavea is a civic technology firm based in Philadelphia that uses geospatial data to build software and data analytics for the web. As a B Corporation, our mission is to use advanced geospatial technology for civic, social, and environmental impact. Most of our customers are local governments, non-profit organizations, and academic or federal research projects. We build custom web applications; perform geospatial analysis; manage and contribute to several open source civic software projects (DistrictBuilder, OpenTreeMap, GeoTrellis, and others). Our engineers work across the technology stack, from modern browser-based front-ends to robust service-based backends residing on scalable infrastructure.</p>\n\n<p>We’re looking for a software engineer that is passionate about building applications that will have a positive impact – someone interested in public service, but not necessarily in working for a government or a non-profit organization. We are looking for generalists who thrive on working in a variety of technology environments, and want to build user-focused applications that sit on top of well-engineered infrastructure.</p>\n\n<p>We’re excited about what we do, we're growing, and we hope you will join us.</p>\n\n<p>Skills &amp; Requirements</p>\n\n<p>The Geospatial Insights Team</p>\n\n<p>Azavea has a handful of engineering teams, all of which develop web software for processing and visualizing geospatial data. The teams differ in terms of the specific projects they develop and whether they are primarily focused on products or professional services. The Geospatial Insights team currently focuses on developing two web products: HunchLab and DistrictBuilder. HunchLab is a SaaS offering for law enforcement agencies that applies statistics and machine learning to create a proactive patrol management system used to improve public safety in communities across the country. DistrictBuilder is an open source web application for engaging the public with the legislative redistricting process. The Geospatial Insights team does most of its work with JavaScript (AngularJS), Python (Django), Scala, and PostgreSQL. All supporting infrastructure for applications resides on Amazon Web Services (AWS) and is delivered with a combination of Ansible, Docker, Terraform, and a wide variety of AWS services.</p>\n\n<p>What You’ll Do:</p>\n\n<ul>\n<li>Build features, APIs and web clients based on wireframes and designs developed by our UX Design team. </li>\n<li>Engage in multidisciplinary work that applies an agile process (scrum board, daily stand-ups and two-week iterations) to design, architect, develop, test and deploy software. </li>\n<li>Optimize database, service and client performance to create applications with both functional and responsive user experiences. </li>\n<li>Build and deploy services in a repeatable way to AWS. </li>\n<li>Contribute to both a growing company and to the open source communities that support our work.</li>\n</ul><p>You should:</p>\n\n<ul>\n<li>Know how to build and support scalable web applications in Python/Django, Scala/Akka HTTP, or other language-specific web framework. </li>\n<li>Demonstrate fluency in core web technologies (HTML/CSS/JS) and contemporary JavaScript libraries like AngularJS and React. </li>\n<li>Understand how AWS, Docker, and Terraform help our infrastructure. </li>\n<li>Be comfortable with virtualization or containerization in a UNIX environment. </li>\n<li>Be excited about working with a small, collaborative team on meaningful projects.</li>\n</ul><p>You get extra points for:</p>\n\n<ul>\n<li>Background in math and statistics. </li>\n<li>Experience with open source or commercial geospatial toolkits like OpenLayers, Leaflet, GeoServer, PostGIS, CARTO, ArcGIS, and GoogleMaps. </li>\n<li>Experience with mobile apps (iOS, Android or React Native). </li>\n<li>Experience scaling applications within AWS. </li>\n<li>Knowledge of distributed computing frameworks, like Hadoop, Spark, and Amazon MR. </li>\n<li>Demonstrating your open source or other community service contributions.</li>\n</ul><p>You’ll notice that we don’t say “X-Y years of experience” or “M.S. in Computer Science.” Formal credentials like these are not irrelevant, but we are primarily looking for people who have had experience successfully building sophisticated web applications. You might have had these kinds of experiences without a college degree. Or you may be just out of school but worked your way through school and had some great co-op experiences. Or you might have a math or humanities background but a have a great head for software development. These are all potentially great backgrounds, and we’d be interested in hearing from you.</p>\n\n<p>Office and Benefits</p>\n\n<p>Our Philadelphia office is located in a brightly lit office on the 5th floor of a converted factory building in the Callowhill neighborhood, a short walk from Center City, the Reading Terminal Market, and SEPTA subway and regional rail stations. For bicyclists, we have in-house bike parking, a shower and lockers. It’s an open office plan with several smaller rooms for team meetings, private space and concentration time. You get a top-end Linux workstation or Apple laptop with extra monitors. We have flex-time to deal with personal stuff, and most people work a 40 - 45 hour week on a regular schedule. After the first six months, our staff can also spend up to 10% of their time on a geospatial open source, professional development, or R&amp;D project. For example, some of our colleagues are contributors to the PostGIS, OpenLayers, GDAL and GeoTrellis projects. Other research projects have included improving application delivery tool chains; using FFT for fast kernel density estimation; working with Spark to develop machine learning tools; and using GPUs for faster raster data processing. Once a quarter, we all get together to share our research and learning with our colleagues.</p>\n\n<p>We offer a salary commensurate with skills and experience and a benefits package that includes:</p>\n\n<ul>\n<li>Fully subsidized health care, dental, prescription plan, including for spouse/partner and children </li>\n<li>Fully subsidized life and long term disability insurance, plus voluntary short term disability insurance </li>\n<li>Medical reimbursement plan to cover what the health insurance does not </li>\n<li>Retirement plan with matching percentage </li>\n<li>Almost 4 weeks paid vacation plus additional paid sick/personal time off </li>\n<li>Family and medical leave </li>\n<li>Flexible work schedule </li>\n<li>Paid maternity and paternity leave </li>\n<li>Child care subsidy </li>\n<li>Paid time off for voting and volunteering </li>\n<li>Education assistance plan </li>\n<li>Student loan assistance </li>\n<li>Public transit and biking reimbursement plans </li>\n<li>Monthly guest lectures with lunches on the house </li>\n<li>10% time for research or learning projects </li>\n<li>Profit-sharing bonus plan </li>\n<li>Financial transparency through an open book policy </li>\n<li>Kind, capable and thoughtful colleagues</li>\n</ul><p>We welcome qualified candidates from all walks of life and value diversity in our company, and we prohibit discrimination based on race, color, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, veteran status, military service, disability unrelated to job requirements, marital status, or domestic partner status.</p>",
    "how_to_apply": "<p><a href=\"https://www.azavea.com/\">https://www.azavea.com/</a></p>",
    "company": "Azavea",
    "company_url": "https://www.azavea.com/",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/6eb7498a-a3ba-11e7-83bc-14241500d139"
  },
  {
    "id": "efa54c22-a3b0-11e7-9e13-de63106e0f6d",
    "created_at": "Wed Sep 27 18:27:03 UTC 2017",
    "title": "Senior DevOps Engineer",
    "location": "Irvine, CA",
    "type": "Full Time",
    "description": "<p>Ever wanted to be part of a tech-startup from the ground up?  A new ADVENTURE where you're among the first 100 employees at a FULLY funded startup developing NEW, never before offered WORLD CLASS cloud video solutions that'll GLOBALLY change video tech forever?  Your opportunity is here!  We're diligently preparing for our PRODUCT LAUNCH and we're looking for deeply experienced SENIOR DEVOPS ENGINEERS who are NOT just looking for a new \"job,\" but instead seek to MAKE HISTORY by passionately developing new products that'll change entire industries and the use of video technologies around the world!\nIf you're ready and selected, we offer much of the standard perks that startups offer, such as an amazing open  workspace, along with relocations (2 months free apartment if hired), visa services (after one year), 10 day hiring process if hired, and sign-on bonuses!\nIf you're passionate about developing the very best cutting-edge DevOps experience for users, then this is your OPPORTUNITY to convert our Arcus Cloud vision to reality by being the most senior DevOps developer &amp; informal technical go-to person for DevOps and techOps focused engineers. Your job will be 50% development and 50% as a lead.</p>\n\n<p>Primary Responsibilities</p>\n\n<p>Be the 1st DevOps Engineer who will shortlist and partner with our CPO to hire and develop strong and highly effective DevOps engineers for our newly established U.S. engineering site - the headquarters and origin of the Arcus vision, development, and governance of the cloud-based solution.\nBe part of and collaborate with software engineering teams to deploy and operate our service, help automate and streamline our operations and processes, build and maintain tools for deployment, monitoring and operations and troubleshoot and resolve issues in our dev, test and production environments.\nPlan operational activities, provide technical leadership in the development of a new Cloud based service, frequently operating at the leading edge of technology as well as mentoring Cloud operations engineers.</p>\n\n<p>Qualifications and requirements</p>\n\n<p>A Masters in Computer Engineering, Science or equivalent and 7+ years of solid background in the fundamentals of software development, and have a deep understanding of best practices &amp; data models in various backend frameworks/technologies/services/ &amp; systems.\nExperience in an end to end role having focused on bridging strategy to tactical planning to execution as well as produced code &amp; activity get into technical details on daily basis.\nExcellent devOps practices and a notable track record having worked across organizational boundaries, delivering automated, scalable, secure SaaS solutions. Experience to scale a SaaS solution from idea to first general availability to global scale.\nSaaS experience with strong understanding of Microservices architectures, patterns and practices.\nExperience with GCP or any public cloud (Azure, AWS etc); a wide variety of open source technologies and cloud services such as Jenkins, Github, Teamcity, or Pagerduty; SQL based databases like MySQL, Maria DB, Oracle, MS SQL; networking principles and TCP/IP; scripting languages (e.g. PowerShell, Python, or Bash)</p>\n\n<p>Preferably sound OO design and programming skills in e.g. Java or Python or Go or C++ or Node.js\nAbility to think big &amp; strategically, but prioritize to stay on top of tactical execution with a can-do and sense of urgency attitude.</p>\n\n<ul>\n<li>Relocation services will be provided</li>\n<li>Including furnished apartment for up to 2 Months</li>\n<li>Sign-on Bonus available</li>\n<li>Max 10 hiring process (if selected)</li>\n<li>Visa / Green Card support after 1 year of employment</li>\n</ul>",
    "how_to_apply": "<p><a href=\"mailto:hr@arcusnext.com\">hr@arcusnext.com</a></p>",
    "company": "Arcus Global",
    "company_url": "http://Arcusnext.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/efa54c22-a3b0-11e7-9e13-de63106e0f6d"
  },
  {
    "id": "e81de35e-a3ad-11e7-90d6-75c0da0d06bf",
    "created_at": "Wed Sep 27 18:06:16 UTC 2017",
    "title": "Senior Front End Engineer Developer",
    "location": "Irvine, CA",
    "type": "Full Time",
    "description": "<p>Ever wanted to be part of a tech-startup from the ground up? A new ADVENTURE where you're among the first 100 employees at a FULLY funded startup developing NEW, never before offered WORLD CLASS cloud video solutions that'll GLOBALLY change video tech forever? Your opportunity is here! We're diligently preparing for our PRODUCT LAUNCH and we're looking for deeply experienced FRONT END ENGINEERS who are NOT just looking for a new \"job,\" but instead seek to MAKE HISTORY by passionately developing new products that'll change entire industries and the use of video technologies around the world!</p>\n\n<p>If you're ready and selected, we offer much of the standard perks that startups offer, such as an amazing open workspace, along with relocations (2 months free apartment if hired), visa services (after one year), 10 day hiring process if hired, and sign-on bonuses!</p>\n\n<p>Primary Responsibilities</p>\n\n<p>Deliver the best-in-class customer experience by designing, developing, integrating, deploying, and troubleshooting on software front-end technologies for developing cloud solutions using server-less architecture as well as Microservices, Event-driven systems, polyglot databases, cloud based tools, infrastructure and storage.\nCollaborate with principle Engineer, UX designer, Senior Product Owner(s) and several development teams throughout the product lifecycle producing timely and top-quality deliveries on our cloud platforms.\nBe a go to person, mentor and coach for other less senior frontend engineers.\nThe job will be 95% development and 5% as a lead.</p>\n\n<p>Professional Qualifications</p>\n\n<p>Must have 10+ years experience, with XHTML, HTML 5, JavaScript, CSS, CSS3 and general Web 2.0 techniques\nMust have 3+ years experience with at least Angular 2, Express, Hapi, React, or Redux\nMust have 3+ years experience of building large Enterprise level web applications\nMust have 5+ years of interacting with Rest APIs at scale\nMust have 3+ years experience with Responsive Design using frameworks such as Bootstrap, etc. and strong competencies with design patterns\nMust have 8+ months of experience with maintaining and building Microservices Architecture in production using containers\nMust have 10+ years experience producing code, planning, forecasting, and get into technical details on a daily basis\nPreferably 10+ years experience OO design and programming skills, such as, Java or Python or Go or C++ or Node.js</p>\n\n<p>Preferred experience with building UI frontend tests</p>\n\n<p>A Master in Computer Engineering, Science or equivalent and 5+ years of solid background in the fundamentals of software development, and have a deep understanding of best practices in various client side frameworks &amp; technologies.\nPersonal Skills</p>\n\n<p>Take great personal pride and showcase unfailing passion on behalf of our customers when developing efficient, easy, and scalable web interfaces for feature rich enterprise cloud services.\nAbility to think big &amp; strategically, but prioritize to stay on top of tactical execution with a can do and sense of urgency attitude – takes pride work.</p>\n\n<p>Must be a self-starter and motivated by delivering products with relentlessly high standards through a combination of best practices and innovation – expects and encourage the same from team members.\nStrong execution focus with ability to build and manage strong cross-group relationships.\nJob Type: Full-time</p>",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:HR@arcusnext.com\">HR@arcusnext.com</a> to apply</p>",
    "company": "Arcus Global",
    "company_url": "http://arcusnext.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/e81de35e-a3ad-11e7-90d6-75c0da0d06bf"
  },
  {
    "id": "a271b342-a396-11e7-8339-6e3de7866a04",
    "created_at": "Wed Sep 27 15:15:02 UTC 2017",
    "title": "Commerce Engineer, Apple Media Products",
    "location": "New York",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The Apple Media Products Commerce Engineering team is looking for an experienced, talented and self-motivated software engineer to lead several data architecture and technical compliance efforts across the commerce landscape. Join our exciting engineering team that has been leading the digital distribution industry by constantly developing innovative features to grow and expand the iTunes Store, App Store, iBooks Store and services such as Apple Music.</p>\n\n<p>The position requires someone comfortable with all aspects of the software design lifecycle and experienced with high performance distributed systems. If you thrive in a dynamic cross-functional environment and are able to pivot with constantly evolving requirements and new technologies, you’ll love it here.</p>\n\n<p>Key Qualifications:</p>\n\n<ul>\n<li>5-10 years of relevant work experience designing, implementing, and supporting highly scalable and highly reliable applications and web services.</li>\n<li>Extreme attention to detail and ability to self-audit work</li>\n<li>Exceptional Java and object-oriented programming skills</li>\n<li>In-depth knowledge of relational database systems (Oracle preferred) as well as NoSQL data stores and data modeling</li>\n<li>Familiarity with data privacy and data protection regulations and standards</li>\n</ul><p>Description:\nCustomer privacy is very important at Apple and we take tremendous care in how we collect, use, disclose, transfer, and store the information of our customers. You will lead an engineering team within Apple Media Products (AMP) Commerce Engineering to develop technical solutions to global data privacy regulations covering several areas including data access/consent and data retention. You will work cross-functionally with several teams including Apple-wide program management, legal and privacy, anti-fraud, big data and data warehousing, design, UI, operations, and production support on designing, building or enhancing scalable systems that are used across the commerce data landscape.</p>\n\n<p>You will be challenged to manage, evolve, and invent new features to address ever-changing regulations. In addition, you must master new technology quickly, be comfortable working in a fast-paced environment, have a “can-do” attitude. Superior negotiating skills and excellent communication skills will be critical in this role.</p>\n\n<p>Education:\nBS in Computer Science/Software Engineering or equivalent. MS preferred.</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=6f842828725f7fa26f7300fe326206a2\">https://ars2.equest.com/?response_id=6f842828725f7fa26f7300fe326206a2</a>\nREQUISITION NUMBER: 113028813</p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/807af83e-a396-11e7-860d-7aca4b13d2a8.jpeg",
    "url": "http://jobs.github.com/positions/a271b342-a396-11e7-8339-6e3de7866a04"
  },
  {
    "id": "9d43324c-a396-11e7-8f65-15cf1969f1a5",
    "created_at": "Wed Sep 27 15:14:53 UTC 2017",
    "title": "Senior Big Data Engineer",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>As a member of the Siri Data Engineering Operations team within the Siri organization, you will be faced with highly complex issues in a large scale, distributed system environment. In order to ensure a reliable and rewarding Siri experience, you will be empowered to develop and design new solutions heavily focused on system automation. We look for talented engineers in both the Operations and Development space to bring these unique solutions to production at a rapid pace. From an Operations perspective, this makes us the most successful personal assistant in the industry.</p>\n\n<p>Key Qualifications:\n•Knowledge of the Linux operation system (OS, networking, process level)\n•Understanding of Big Data technologies (Hadoop, Hbase, Spark, Kafka, Flume, Hive, etc)\n•Understanding of one or more object-oriented programming languages (Java, C++)\n•Fluent in at least one scripting language (Shell, Python, Ruby, etc.)\n•Strong verbal and written communication skills\n•Passionate about being a part of a tight-knit Operations team</p>\n\n<p>Description:\nThe Siri Data Engineering Operations team manages the platform for both ingestion and analytics of worldwide Siri events. To accomplish this, we build automation tools and services to prevent failures and page out individuals when there really is a problem, not just noise.</p>\n\n<p>Our engineers not only work closely with Operations, but also with the development and analytics engineers within Siri, as well as outside organizations. We build data pipelines for maximum efficiency, scalability and reliability to allow domain specific engineers to focus on their specialties. A successful candidate will have experience in being a Systems Administrator that has moved on to development and automation in their career.</p>\n\n<ul>\n<li><p>Operate Apple’s largest infrastructure supporting millions of Siri customers at double digit PB scale</p></li>\n<li><p>Troubleshoot complex issues across the entire stack</p></li>\n<li><p>Design and develop automation frameworks to handle both development and production events at scale</p></li>\n<li><p>Advise other teams (within and outside of Siri) on technical direction</p></li>\n<li><p>Make changes to our environment with the purpose of pushing Siri to the next level</p></li>\n</ul><p>Education:\nB.S. degree in Computer Science or 3+ years of building data pipelines experience or equivalent.</p>\n\n<p>Additional Requirements:\n(Nice to have)</p>\n\n<ul>\n<li>Java JVM performance tuning/optimizations</li>\n<li>Mesos compute platforms and job schedulers</li>\n</ul><p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=7983283230f4fa7607cbf0a9c481bb8f\">https://ars2.equest.com/?response_id=7983283230f4fa7607cbf0a9c481bb8f</a>\nREQUISITION NUMBER: 99613876</p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/9abda2e6-a396-11e7-8f15-e54e149b83fb.jpeg",
    "url": "http://jobs.github.com/positions/9d43324c-a396-11e7-8f65-15cf1969f1a5"
  },
  {
    "id": "009b8ae6-a389-11e7-82cf-89de86ddb923",
    "created_at": "Wed Sep 27 13:38:03 UTC 2017",
    "title": "Lead Software Engineer - Backend",
    "location": "London",
    "type": "Full Time",
    "description": "<p>Join us and help revolutionise an already groundbreaking product. You’ll have the space to iterate and innovate, and the time to experiment and craft your skills and\nour product. Working together, we can get things done properly. We can help change the world.\nConstant development of Mendeley Reference Manager is a key part of this challenge. You’ll be working on the tool that allows researchers to connect with one another, collaborate, organise, read, annotate and cite documents. As part of Elsevier, you'll be applying the latest web technologies and advanced information retrieval techniques. All to help extract knowledge from the world’s largest medical and scientific knowledge base.</p>\n\n<p><strong>Lead Software Engineer - Backend</strong></p>\n\n<p>You’ll be working with the latest cross platform technologies including an Electron framework, great design, and a Java microservices cloud architecture with a REST API. An expert on backend development and scalable, RESTful APIs, you will line manage a team of software engineers with different skill sets.\nCentred around a common functional area of the Mendeley product base, you will be working with experts in their fields. At the same time you will also play a significant part in the mentoring and development of junior team members.\nWe deal with a considerable amount of data, including a billion user documents in SQL and NoSQL databases. So you will be a strong hands-on Java coder, able to share solid engineering practices with your colleagues.\nYou will be working closely with product managers and UX professionals to create user-centred products. You’ll also contribute to the agile process, ensuring that there is a shared vision for the team, that tasks are well defined and actionable, and that everyone knows what they’re working on.</p>\n\n<p><strong>Minimum requirements</strong></p>\n\n<p>You will have worked as a technical lead, or have taken a leading role within a development team. This means you will have great team skills, including the ability\nto get your idea across and to work with colleagues to get the ‘best answer’.</p>\n\n<p>You should have:</p>\n\n<ul>\n<li>Proven expertise in Java</li>\n<li>Experience with AWS or a similar cloud provider</li>\n<li>A history of building and taking products to market</li>\n<li>A bias for simplicity, elegance, scalability, robustness and maintainability in code and systems</li>\n<li>Experience in leading and mentoring junior colleagues</li>\n</ul><p>You should be comfortable designing architectures that allow rapid iterations to support our agile development process, whilst considering future requirements and the big picture when planning and developing new applications and features. Quality is important to you and you support a culture of pair programming, test driven development, devops, code reviews and constant communication. You should enjoy acquiring new skills and expertise as required by the project.</p>\n\n<p><strong>Join our team</strong></p>\n\n<p>We know that every tech company is trying to make the workplace more exciting and more fun. But we believe we combine a great place to work and outstanding colleagues, with something even more rewarding. We’re using the latest technology and managing large amounts of data to help over 6 million researchers, clinicians\nand engineers tackle the biggest challenges facing humankind. You could be part\nof our team.</p>",
    "how_to_apply": "<p>Please apply through the link:\n<a href=\"https://elsevier.recsolu.com/external/form/UTt4QblTDorkkJzIHL7u5A\">https://elsevier.recsolu.com/external/form/UTt4QblTDorkkJzIHL7u5A</a></p>",
    "company": "Mendeley",
    "company_url": "https://www.mendeley.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/cd07e7c4-a388-11e7-9950-032bee45f075.png",
    "url": "http://jobs.github.com/positions/009b8ae6-a389-11e7-82cf-89de86ddb923"
  },
  {
    "id": "3ae228f0-a388-11e7-97ef-2e2b993007c8",
    "created_at": "Wed Sep 27 13:32:49 UTC 2017",
    "title": "Senior Software Engineer (Frontend)",
    "location": "London",
    "type": "Full Time",
    "description": "<p>Join us and help revolutionise an already groundbreaking product. You’ll have the space to iterate and innovate, and the time to experiment and craft your skills and\nour product. Working together, we can get things done properly. We can help change the world.\nConstant development of Mendeley Reference Manager is a key part of this challenge. You’ll be working on the tool that allows researchers to connect with one another, collaborate, organise, read, annotate and cite documents. As part of Elsevier, you'll be applying the latest web technologies and advanced information retrieval techniques. All to help extract knowledge from the world’s largest medical and scientific knowledge base.</p>\n\n<p><strong>Senior Software Engineer (Frontend)</strong></p>\n\n<p>You would be working in an autonomous, cross-functional team with a mix of frontend, backend and full-stack developers. You’ll use an Electron framework to make installable desktop apps with web technologies. You’ll also write Progressive Web Applications with an emphasis on offline first and you’ll develop modular JavaScript components with React/Redux.\nWriting modular CSS with SCSS/BEM, you’ll also build browser extensions and collaborate with the UX/UI team to devise elegant solutions to complex challenges.\nJoining us as a senior member of the team, you would be responsible for producing high-quality, clean and performant code, and proving your code works with automated unit, integration and acceptance tests. You’ll undertake pairing, code review and ticket verification. You’ll translate product requirements into software designs and also deploy applications and monitor their performance.</p>\n\n<p>As a Senior Engineer, you would also be expected to help coach and mentor junior members of the team.</p>\n\n<p><strong>Minimum requirements</strong></p>\n\n<p>You should have demonstrable experience working on high traffic websites and a passion for developing performant and engaging web experiences. You’ll also need an open and collaborative approach to delivering software. You should also have:</p>\n\n<ul>\n<li>Commitment to TDD (Test Driven Development) in an agile environment</li>\n<li>Expert knowledge of JavaScript in the browser, on the server and on the command-line (with Node.js, Express etc.)</li>\n<li>Expert knowledge of HTML and CSS</li>\n<li>Strong knowledge of web standards and accessibility issues</li>\n<li>Experience working with version control systems (pull requests, git flow etc.)</li>\n<li>Experience building applications on top of RESTful APIs</li>\n</ul><p><strong>Join our team</strong></p>\n\n<p>We know that every tech company is trying to make the workplace more exciting and more fun. But we believe we combine a great place to work and outstanding colleagues, with something even more rewarding. We’re using the latest technology and managing large amounts of data to help over 6 million researchers, clinicians and engineers tackle the biggest challenges facing humankind. You could be part of our team.</p>",
    "how_to_apply": "<p>Apply through the link:\n<a href=\"https://elsevier.recsolu.com/external/form/jrjhIeQ8Yw9fmkfmwnbCLw\">https://elsevier.recsolu.com/external/form/jrjhIeQ8Yw9fmkfmwnbCLw</a></p>",
    "company": "Mendeley",
    "company_url": "https://www.mendeley.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/1d87274c-a388-11e7-98c7-d53cbcfeaf60.png",
    "url": "http://jobs.github.com/positions/3ae228f0-a388-11e7-97ef-2e2b993007c8"
  },
  {
    "id": "80cfabf8-a365-11e7-8ddc-b52aa7af4cd1",
    "created_at": "Wed Sep 27 09:23:54 UTC 2017",
    "title": "Web Developer for European Molecular Biology Laboratory",
    "location": "Heidelberg, Germany",
    "type": "Full Time",
    "description": "<p>The European Molecular Biology Laboratory (EMBL) is one of the highest ranked scientific research organisations in the world. The Headquarters Laboratory is located in Heidelberg (Germany), with additional sites in Grenoble (France), Hamburg (Germany), Hinxton near Cambridge (UK), Rome (Italy) and Barcelona (Spain).</p>\n\n<p>EMBL is looking for a Web Developer who will actively participate in the development, deployment, and application of algorithms and software for analysis and visualization of big imaging mass spectrometry data. This position is open within two research projects: the European Horizon2020 research project METASPACE on Bioinformatics for Spatial Metabolomics and the NIH research project Spatial Metabolomics for Kidney.</p>\n\n<p>You will be a critical part of the dynamic, interdisciplinary, international and cross-cultural Alexandrov team where we work at the intersection of biology, chemistry, and computer science. We use advanced software engineering to develop professional open-source software for data science, computational biology, and data visualization. Our results were published in top-level bioinformatics and methods journals and were highlighted by various scientific journals (Nature, PNAS, PLoS) and public media (CNN, Der Spiegel, Wired, Health, BusinessInsider).</p>\n\n<p>You will contribute to the forefront of science at the intersection of imaging, computational biology, and big data analysis. You will develop web applications for analysis and visualization of big molecular data generated by imaging mass spectrometry. You will work with users from throughout the world applying our tools in biology, medicine, and pharma. You will work with partners developing other online services, in particular those from European Bioinformatics Institute (EBI).\nWe love using modern software technologies including (but not limited to) Python 3, scipy, pandas, GraphQL, Node.js, View.js, Docker, CircleCI, git, Amazon Web Services, Apache Spark and Ansible. Our main software product is METASPACE:\n<a href=\"http://annotate.metaspace2020.eu\">http://annotate.metaspace2020.eu</a>, <a href=\"https://github.com/METASPACE2020\">https://github.com/METASPACE2020</a>.</p>\n\n<p>We offer a goal-oriented environment, flexible working hours and great career opportunities. English is the working language.</p>\n\n<p>Qualifications and Experience</p>\n\n<p>We are looking for a university graduate with a degree involving computer science, mathematics, or any equivalent computational component. Essential qualifications: strong programming skills, knowledge of Python, experience with or desire to learn JavaScript (including server side), familiarity with CSS and HTML magic, interest in or practical knowledge of modern web frameworks, willingness to work in a small interdisciplinary team. Having any of the following qualifications is a plus: experience with Amazon Web Services, knowledge of data visualization, interest to science.</p>\n\n<p>Additional Information</p>\n\n<p>EMBL is an inclusive, equal opportunity employer offering attractive conditions and benefits appropriate to an international research organisation with a very collegial and family friendly working environment. The remuneration package comprise a competitive salary, a comprehensive pension scheme, medical, educational and other social benefits, as well as financial support for relocation and installation, including your family.</p>\n\n<p>Please note that appointments on fixed term contracts can be renewed, depending on circumstances at the time of the review.</p>",
    "how_to_apply": "<p>Application Instructions</p>\n\n<p>Please apply online through <a href=\"http://ig14.i-grasp.com//fe/tpl_embl01.asp?newms=jj&amp;id=56067&amp;aid=15470\">http://ig14.i-grasp.com//fe/tpl_embl01.asp?newms=jj&amp;id=56067&amp;aid=15470</a></p>",
    "company": "European Molecular Biology Laboratory",
    "company_url": "http://www.embl.org",
    "company_logo": "http://github-jobs.s3.amazonaws.com/6a99904c-a365-11e7-97d6-4bab88ab930f.png",
    "url": "http://jobs.github.com/positions/80cfabf8-a365-11e7-8ddc-b52aa7af4cd1"
  },
  {
    "id": "34cbeb90-a315-11e7-8253-aac233d03bfe",
    "created_at": "Tue Sep 26 23:49:25 UTC 2017",
    "title": "Infrastructure & Backend Developer",
    "location": "Flexible",
    "type": "Full Time",
    "description": "<p>DailyKos, the leading online progressive blogging and activism platform, is looking for an Infrastructure &amp; Backend Developer. DailyKos is a great place to work-- your code will be used by hundreds of thousands of people a day who care deeply about progressive politics and are working to effect real political change. We provide an extensive feature set that extends from blogging to activism and beyond. If you want a job that provides more than just a technical challenge, we'd love to hear from you.</p>\n\n<p>The job offers a flexible work environment, the ability to work remotely on a distributed team of self-sufficient collaborators, competitive salary and benefits, and we provide an Apple MacBook Pro or your comparable preferred hardware. Our organizations commitment to personal growth reduces churn and encourages a very rewarding long term position. We have an energized team filled with great people with different backgrounds.</p>\n\n<p>We are seeking a self-sufficient, operations-at-scale experienced remote worker who:</p>\n\n<pre><code>*can comparatively weigh tradeoffs of different configuration management, scheduling, and infrastructure design approaches\n*has a deep understanding of distributed systems from the network level up\n*has experience with AWS deployments relying on EC2 primitives (VPCs, subnets, security groups, instances, load balancers, auto scaling groups, ...) and preferably RDS too.\n*has experience with convergent and congruent configuration management systems and can articulate the pros or cons of each\n*has exposure to functional programming such as with the Nix expression language or Haskell\n*has exceptional operational troubleshooting capabilities\n*has operationally managed stateful services like Kafka or ElasticSearch and their upgrades, or other complex stateful JVM infrastructure components with a production-level SLA\n*has interest in working on backend services or monitoring systems which are currently written in Ruby and Haskell. Haskell coaching, pointers, reviews available for your growth, not required upfront. :)\n*has production experience deploying Nix/NixOS systems at scale (highly preferred).\n</code></pre>\n\n<p>At Daily Kos, we believe that the diversity of ideas, experiences and cultures that our employees contribute to our organization help us be more effective in our work, and we are proud to be an inclusive and equal-opportunity workplace. We're a company that loves learning and supports growth and training for all our employees.</p>\n\n<p>To apply, please send an email to <a href=\"mailto:tech_jobs@dailykos.com\">tech_jobs@dailykos.com</a> with the name of the position in the subject line, a cover letter, code sample or github repo and your resume (include your LinkedIn profile link).</p>",
    "how_to_apply": "<p>To apply, please send an email to <a href=\"mailto:tech_jobs@dailykos.com\">tech_jobs@dailykos.com</a> with the name of the position in the subject line, a cover letter, code sample or github repo and your resume (include your LinkedIn profile link).</p>",
    "company": "Daily Kos (Kos Media LLC)",
    "company_url": "https://www.dailykos.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/2fb857e2-a315-11e7-8386-f0f9bbe98688.png",
    "url": "http://jobs.github.com/positions/34cbeb90-a315-11e7-8253-aac233d03bfe"
  },
  {
    "id": "98a74a06-a301-11e7-8db6-ada15a500228",
    "created_at": "Tue Sep 26 21:28:54 UTC 2017",
    "title": "Senior Software Engineer ",
    "location": "Folsom CA ",
    "type": "Full Time",
    "description": "<p>Come help develop the future of software used in industrial automation. In this position, you would join our core product development team. Together, we work to build our primary product, Ignition. </p>\n\n<p>This position is focused on implementing and maintaining network protocols for communicating with industrial controllers (PLCs, RTUs, etc…) as well as the system responsible for bridging data from those implementations into the Ignition platform. Responsibilities include new feature and protocol development as well as the maintenance and enhancement of existing functionality.</p>\n\n<p>We are a tight-knit team of developers working every day to delight customers worldwide with a product they actually need. If this sounds like something you’d like to be part of we look forward to talking to you.</p>\n\n<p>Responsibilities</p>\n\n<ul>\n<li>Work with software engineering team to help guide direction and design of future releases</li>\n<li>Implement new features and changes with an eye for security, reliability, and performance</li>\n<li>Help maintain software by fixing issues identified by support and QA teams</li>\n<li>Perform complex and precise troubleshooting to pinpoint root causes for reported issues</li>\n<li>Participate in agile development process (SCRUM)</li>\n<li>Perform code reviews to help verify changes made by other developers</li>\n<li>Follow Java and object-oriented design industry best practices</li>\n</ul><p>Requirements</p>\n\n<ul>\n<li>B.S. in Computer Science, or equivalent experience</li>\n<li>Minimum 5 years of programming experience</li>\n<li>Strong Java 8 skills</li>\n<li>Experience writing server and networking code</li>\n<li>Experience writing highly concurrent multithreaded code</li>\n<li>Modern toolchain and source control familiarity, e.g. Maven/Gradle and Git/Hg</li>\n<li>Excellent communication skills</li>\n<li>Excellent analytical and troubleshooting skills</li>\n</ul><p>Skills Not Required, But a Plus</p>\n\n<ul>\n<li>Experience with OPC Classic or OPC UA</li>\n<li>Experience with industrial automation fieldbuses or protocols such as Modbus, EtherNet/IP, \n    Omron FINS, Siemens S7, Emerson/Fisher ROC, ABB Totalflow (DB/DB2), etc…</li>\n<li>Experience with PLCs and/or PLC programming</li>\n<li>Any other relevant experience in industrial automation </li>\n</ul><p>Inductive Automation, LLC is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, sexual orientation, gender identity, and status as a protected veteran or individual with a disability.</p>\n\n<p>Verification of US employment eligibility required</p>",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:jobs@inductiveautomation.com\">jobs@inductiveautomation.com</a></p>",
    "company": "Inductive Automation",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/7faf6fc4-a301-11e7-91b8-79f50019f152.png",
    "url": "http://jobs.github.com/positions/98a74a06-a301-11e7-8db6-ada15a500228"
  },
  {
    "id": "570e1548-a2fc-11e7-9653-28c412837009",
    "created_at": "Tue Sep 26 20:55:11 UTC 2017",
    "title": "Senior Web Application Engineer (full-stack)",
    "location": "California, North Carolina, Massach",
    "type": "Full Time",
    "description": "<p><strong>Aperian Global</strong> is looking for a senior software developer with a passion for beautiful, functional, well-structured code to help rebuild our flagship web application, GlobeSmart (and related online apps/products). </p>\n\n<p>If you’re right for this position, you will be comfortable working with remote team members while actively seeking opportunities for collaboration. You feel right at home crafting a reliable, well-tested API for internal and third party use. You care about the details when it comes to deployment, commit history, refactoring, design patterns, and other development practices. You have a standards-centric view of the Web, know its limitations and possibilities, and care about performance and progressive enhancement.</p>\n\n<p>We’re looking for an individual who is excited to form the foundation of a growing team. Our team will enable individuals, corporations and <strong>Aperian</strong> service professionals to work effectively across boundaries.</p>\n\n<p><strong>Requirements:</strong>\nWe love working with good people who care about our customers and each member of the team. On top of that, we’re looking for someone with experience with the following:</p>\n\n<p><strong>Top</strong></p>\n\n<p>-Javascript/NodeJS</p>\n\n<p>-PHP</p>\n\n<p>-React</p>\n\n<p>-ExpressJS</p>\n\n<p>-Git</p>\n\n<p>-Drupal</p>\n\n<p><strong>Beneficial</strong></p>\n\n<p>-HTML, CSS, and Sass</p>\n\n<p>-Pattern Libraries</p>\n\n<p>-Amazon Web Services (AWS)</p>\n\n<p>-Google Cloud Platform (GCP)</p>\n\n<p>-Software security</p>\n\n<p>-Web Performance</p>\n\n<p>-Software Architecture</p>\n\n<p>-Continuous Delivery</p>\n\n<p>-Automated Testing</p>\n\n<p>Within <strong>Aperian</strong>, you will work directly with product directors, project managers, founders, technical directors, frontend developers, frontend designers, and contractors.</p>\n\n<p><strong>Other Qualifications:</strong></p>\n\n<p>-Collaborative</p>\n\n<p>-Able to successfully participate in paired programming</p>\n\n<p>-Detail oriented</p>\n\n<p>-Can work quickly and accurately</p>\n\n<p>-Quick learner</p>\n\n<p>-Resourceful </p>\n\n<p>-Clear and articulate communicator</p>\n\n<p>-Strong interpersonal skills</p>\n\n<p>-Bachelors’ in related field or 5 to 7 years of applicable experience</p>\n\n<p>-Occasional travel required</p>\n\n<p><strong>Who Are We?</strong>\nWith over 25 years of experience, <strong>Aperian Global</strong> partners with organizations to develop the skills necessary for success in a global work environment. We provide learning solutions via facilitated programs, online learning tools &amp; consulting services in the areas of Leadership Development, Global Mindset, Team Effectiveness &amp; Global Mobility. For more information, please visit:  (<a href=\"http://www.aperianglobal.com\">http://www.aperianglobal.com</a>.</p>\n\n<p><strong>Why Work For Us?</strong> \nWe are a passionate mission and values driven company that trains organizations around the globe to have a better understanding of cultural differences as they conduct business with each other. Our mission is to develop the capabilities of individuals, teams and organizations to perform effectively worldwide in order to create a sustainable global future. </p>\n\n<p>We offer the <strong>possibility of working remotely from your home office</strong> or in beautiful office surroundings in Oakland, CA as well as competitive compensation and a generous benefits package (14  holidays plus 3 weeks of vacation a year). For more information check us out on our website at <a href=\"http://www.aperianglobal.com\">http://www.aperianglobal.com</a>. </p>\n\n<p><strong>To apply</strong> for the position, please send your resume, cover letter and general salary requirements to us.hr@aperianglobal.com.  Please cite job title and (GIT) in the subject line.  EOE</p>",
    "how_to_apply": "<p>Please send your resume, cover letter and general salary requirements to us.hr@aperianglobal.com.  Please cite job title and (GIT) in the subject line</p>",
    "company": "Aperian Global Inc.",
    "company_url": "http://www.aperianglobal.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/4f01333a-a2fc-11e7-9ae0-da2d0975906d.jpg",
    "url": "http://jobs.github.com/positions/570e1548-a2fc-11e7-9653-28c412837009"
  },
  {
    "id": "7f1ca006-a2dc-11e7-8b15-1d130a8d0dee",
    "created_at": "Tue Sep 26 17:02:36 UTC 2017",
    "title": "Software Integration Engineer, Health Software",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>Want to help make a deep impact on the lives of hundreds of millions of people all over the world? Are you passionate about shipping code? Come join a team of enthusiastic, hard working, diverse and highly talented people developing life changing software!\n \nThe Health Software team is looking for a talented \"jack of all trades\" who is technically savvy, proactive, detail oriented, and can juggle various tasks efficiently. You will be a member of the software engineering team working side by side with engineers. </p>\n\n<p>Key Qualifications:\n•Knowledge of consumer-oriented software development processes\n•Familiar with general Software Quality Assurance methodologies\n•Proficiency in one or more programming languages\n•Excellent verbal and written communication skills\n•Proven track record of being proactive, self-motivated, detail-oriented, and well organized\n•Strong analytical and problem-solving skills</p>\n\n<p>Description:\nResponsibilities\nReview all incoming bugs, verify reproducibility, perform regression testing\nWrite test tools to aid in reproducing and debugging bugs\nBuild up encyclopedic knowledge of bugs in our components\nGather debug information for problem reports as needed\nUse debugging and performance analysis tools to do initial analysis of bug reports\nTest pre-submission engineering changes and submit projects\nProficiency in one or more programming languages\nBuild and maintain tools to help the team remain productive and efficient</p>\n\n<p>Education:\nBS Computer Science or equivalent experience</p>\n\n<p>Additional Requirements:\nComputer Science background\nFamiliarity with git\nKnowledge of Objective-C, Swift, and/or Python/Ruby\nFamiliarity with iOS development tools (Xcode, Instruments)\nExperience with build bots, continuous integration, etc\nFamiliarity with Wellness or Medical concepts is a plus</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=d89798815719eaa8d7f5c87aaeb58fc3\">https://ars2.equest.com/?response_id=d89798815719eaa8d7f5c87aaeb58fc3</a>\nREQUISITION NUMBER: 112883896</p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/7b4341d8-a2dc-11e7-856e-9d4e407a3cb1.jpeg",
    "url": "http://jobs.github.com/positions/7f1ca006-a2dc-11e7-8b15-1d130a8d0dee"
  },
  {
    "id": "de7e3924-a2d7-11e7-86fe-407f4077d8e1",
    "created_at": "Tue Sep 26 16:32:18 UTC 2017",
    "title": "3D Scientific Visualization Software Engineer",
    "location": "New York",
    "type": "Full Time",
    "description": "<p>3D Scientific Visualization Software Engineer</p>\n\n<p>Schrödinger, a technology leader specializing in software solutions for life science research and development, is seeking a highly skilled software engineer to help develop the molecular modeling and visualization application central to our solution suites. The ideal candidate is a software engineer with experience developing software in the field of 3D scientific visualization and graphical user interface. The candidate should be familiar with and eager to adopt and share good software engineering practices. Schrödinger has a strong commitment to engineering as well as science and uses continuous integration, extensive testing, and code review as part of our daily practices.</p>\n\n<p>Responsibilities:</p>\n\n<p>--Actively contribute to the design, implementation, and testing of our multi-platform molecular modeling application</p>\n\n<p>--Troubleshoot bugs and improve the performance of our tool</p>\n\n<p>--Collaborate with the team and other departments (UX, QA, support, backends)</p>\n\n<p>Required skills:</p>\n\n<p>--B.S., M.S., or Ph.D. in Computer Science or related field</p>\n\n<p>--Object-oriented design with C++ or Java (the development will be done in C++11)</p>\n\n<p>--Knowledge of 3D graphics rendering and geometry processing</p>\n\n<p>--Ability to write code that is well-designed, modular, maintainable, testable and documented</p>\n\n<p>--Ability to work autonomously</p>\n\n<p>--Good verbal and written communication skills</p>\n\n<p>Pluses:</p>\n\n<p>--We are using the following technologies; any familiarity with them is a plus: git, Qt, C++ boost libraries, OpenGL, VTK, Python, waf, bash, valgrind</p>\n\n<p>--Programming by contract</p>\n\n<p>--Experience with collaborative work</p>\n\n<p>--Experience with unit and automated testing</p>\n\n<p>--Experience with multiplatform development (Linux, macOS, Windows)</p>\n\n<p>--Experience with a large code base</p>\n\n<p>--Experience developing an elaborated UI, event-driven programming</p>\n\n<p>--Knowledge of scientific visualization</p>\n\n<p>--Knowledge of chemistry</p>\n\n<p>Schrödinger, Inc. is an equal opportunity employer.</p>",
    "how_to_apply": "<p><a href=\"https://www.schrodinger.com/careers/software-engineers/3d-scientific-visualization-software-engineer\">https://www.schrodinger.com/careers/software-engineers/3d-scientific-visualization-software-engineer</a></p>",
    "company": "Schrödinger",
    "company_url": "https://www.schrodinger.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/cfe38fb8-a2d7-11e7-9504-8286de8c6971.png",
    "url": "http://jobs.github.com/positions/de7e3924-a2d7-11e7-86fe-407f4077d8e1"
  },
  {
    "id": "299e3ac4-a2d0-11e7-8057-dd9ef515597b",
    "created_at": "Tue Sep 26 15:34:46 UTC 2017",
    "title": "Front End Engineer",
    "location": "Eindhoven",
    "type": "Full Time",
    "description": "<p><b>Medior Front-end Developer</b></p>\n\n<p>Eindhoven, Noord-Brabant, Netherlands • Engineering</p>\n\n<p><b>DESCRIPTION\nTo support StudyPortals' (<a href=\"https://www.studyportals.com/about/\">https://www.studyportals.com/about/</a>) global expansion we are significantly expanding our Engineering team. The team currently consists of Front- and Back-End Engineers, Dev-Ops as well UX Designers, split over multiple scrum teams.</b></p>\n\n<p>As Front-End Engineer, you will play an important role in enhancing and safeguarding the usability of both our student-facing websites and our internal tools. You will be responsible for taking new ideas from their initial concept to a final implementation by combining our RESTful API with your knowledge of HTML5, CSS3, Service Workers and other JavaScript powered technologies.</p>\n\n<p>You will work in a multidisciplinary scrum team of about five people, cooperating with our graphic designers, UX designers and our Marketing- and University Value teams in order to realize the best implementations possible. In order to measure our effectiveness, we are currently focusing very hard on our continuous deployment process. Adding value to our users with every iteration should be top of mind!</p>\n\n<p><b>REQUIREMENTS</b></p>\n\n<ul>\n<li>At least a Bachelor’s degree, typically one combining aspects from Computer Science and Interaction Design and at least three full years of work experience as web developer.<br>\n</li>\n<li>The ability to write valid, semantically correct, HTML5 and CSS3.<br>\n</li>\n<li>You can not only contribute to our vision and roadmap, but you also have experience in building and optimizing high-traffic websites.<br>\n</li>\n<li>The ability to quickly visualize your ideas by using either graphical tools (such as Photoshop or Illustrator) or pen and paper prototypes.<br>\n</li>\n<li>You believe in a mobile first, responsive approach to web development.<br>\n</li>\n<li>Technologies like Sass, Vue.js (or other component based systems), Gulp and Node.js have already spiked your interest and, if you’re not using all of them already, you can’t wait to start using them.<br>\n</li>\n<li>You are comfortable with collaboration, open communication and reaching across functional borders as part of your day-to-day work.<br>\n</li>\n<li>Fluency in English, both oral and written, and excellent communication skills.<br>\n</li>\n<li>Ambition, energetic and an entrepreneurial drive, you can work well independently but definitely also in a team and you are fun to work with.</li>\n</ul><p><b>BENEFITS</b></p>\n\n<ul>\n<li>A fulltime, 40 hours/week, position.<br>\n</li>\n<li>Competitive salary including a bonus scheme.<br>\n</li>\n<li>Employee referral bonuses; just an extra chance to work with friends (and earn some extra cash!).<br>\n</li>\n<li>A +/- 1000 EUR annual personal development budget, because personal growth is KEY!<br>\n</li>\n<li>An attractive collective insurance package with IAK, covering public and private insurances from healthcare and home insurance to car and liability insurances!<br>\n</li>\n<li>Travel cost reimbursement.<br>\n</li>\n<li>Informal, entrepreneurial, international and flexible atmosphere where self-initiative is highly appreciated.<br>\n</li>\n<li>Our office is in the centre of Eindhoven (Strijp-S), five minutes from the central station.<br>\n</li>\n<li>Interesting extras such as a laptop of your choice.</li>\n</ul><p>Tempted? Get some insight into our company culture by checking out our photos/videos/posts here!(<a href=\"https://www.facebook.com/studyportalscareers/\">https://www.facebook.com/studyportalscareers/</a>)</p>\n\n<p><b>Interested?</b><br>\nApply online via the <b>link</b></p>\n\n<p><a href=\"https://study-portals.redirect.your-jobresponse.com/front_end_engineer_eindhoven/168221/V819/apply\">Click here to apply!</a></p>\n\n<p><b><i>Agency calls are not appreciated.</i></b></p>\n\n<p>Keywords: Job vacancy, Full-time, Eindhoven, IT developer, Front-ender, Front-end engineer, HTML5, CSS3.</p>",
    "how_to_apply": "<p><a href=\"https://study-portals.redirect.your-jobresponse.com/front_end_engineer_eindhoven/168221/V819/apply\">Click here to apply!</a></p>",
    "company": "StudyPortals",
    "company_url": "https://www.studyportals.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/080ee08e-a2d0-11e7-8324-187ff02fd32e.jpg",
    "url": "http://jobs.github.com/positions/299e3ac4-a2d0-11e7-8057-dd9ef515597b"
  },
  {
    "id": "da937528-a2cc-11e7-9592-e96bff7bc627",
    "created_at": "Tue Sep 26 15:13:14 UTC 2017",
    "title": "Senior Software Engineer in de Mechatronica",
    "location": "De Lier",
    "type": "Full Time",
    "description": "<p><b>Bedrijf:</b> Berg Hortimotive, ontwikkelaar en producent van systemen voor mechanisatie van productie en logistiek<br><b>Regio:</b> Vanuit Westland, De Lier, de wereld over</p>\n\n<p>Heb jij ’t vermogen de besturing van machines en logistieke systemen te programmeren? Ben jij klaar om het juiste platform te kiezen en de software voor de nieuwe generatie producten van Berg Hortimotive conform de standaarden die jij juiste acht te ontwikkelen? Dan ben jij degene die ’t bedrijf en klanten in de snel groeiende internationale markten, verder helpt. Wij zijn op zoek naar een </p>\n\n<p><b>Senior Software Engineer in de Mechatronica</b><br><i>Iemand die ’t overziet en snapt, van hardware naar software schakelt en weer terug</i></p>\n\n<p><b>De functie:</b><br>\nJe bouwt nieuwe toepassingen, geeft vorm aan de besturing van bestaande en nieuwe producten en systemen die passen in de Smart Industrie. Je programmeert de steeds intelligentere multi inzetbare wagens welke zich middels ‘GPS’ door de productieruimten bewegen. Het intelligentieniveau van de producten breng je omhoog en je breidt het aantal functionaliteiten uit. De komende jaren bouw je de kennis en capaciteit voor software engineering in de onderneming veder uit, als je wilt wordt jij de <b>Lead Engineer</b> van de discipline in wording. </p>\n\n<p><b>Daarnaast zal jij je bezig houden met de volgende taken:</b></p>\n\n<ul>\n<li>Je bundelt de kennis die nu bij collega’s intern zit, maar ook kennis die bij leveranciers aanwezig is;</li>\n<li>Jij wordt dé trekker, de belangrijke verantwoordelijke voor alle software/PC PLC ontwikkelingen;</li>\n<li>Bestaande besturingsplatformen richt je stap voor stap opnieuw in, je stroomlijnt het gebruik van\nspecifieke talen;</li>\n<li>Regelmatig verzorg je de in bedrijfstelling van de systemen op projectlocatie in binnen- en buitenland;</li>\n</ul><p>Jouw werk geeft invulling aan een hoofdlijn in de toekomstvisie van BergHortimotive: ‘het intelligenter maken van producten en systemen en het genereren, beschikbaar stellen en toepasbaar maken van Big Data voor klanten’. </p>\n\n<p><b>Heb jij analytische en ‘vertaal’ skills?</b><br>\nWe zijn op zoek naar een Software engineer die met een open vizier luisteren kan, zich zelf goed weet uit te drukken zodat optimaal met collega engineers, projectmanagers, R&amp;D medewerkers én met marktpartijen kan worden samengewerkt. Verder haal je enerzijds voldoening uit het programmeren zodat het apparaat doet wat de bedoeling is. Anderzijds behoud jij het overzicht en hecht je er waarde aan om de lijnen waarlangs vandaag en ook de komende jaren ontwikkeld wordt, toekomstbestendig te kiezen. </p>\n\n<p><b>Verder:</b></p>\n\n<ul>\n<li>Werk- en denk je op HBO niveau, je hebt bijvoorbeeld een opleiding informatica, mechatronica, elektronica, industriële automatisering, (een) programmeur opleiding (en) of andere IT opleidingen doorlopen;</li>\n<li>Je beheerst de Nederlandse taal, schakelt gemakkelijk over naar ’t Engels en bent bekend met programmeren in onder andere C#, C++ of IEC61131. Dus je bent thuis in PC programmeren en hebt affiniteit met het programmeren van PLC’s, die volgorde is ’t meest waarschijnlijk. Maar andersom kan ook;</li>\n<li>Je staat stevig in je schoenen, werkt accuraat en vindt het leuk dat (regelmatig) projecten in buitenland worden uitgevoerd;</li>\n</ul><p><b>Werken bij Berg Hortimotive:</b><br>\nBij Berg Hortimotive leveren we oplossingen voor behoeften in mechanisatie en automatisering van intensieve productie- verwerkings- en logistieke omgevingen in de internationale Horti sector. Het bedrijf heeft een prima marktpositie, een klinkende naam, uitstekende producten, vernieuwende projecten onder handen en flink wat nieuwe producten in de pijplijn. Kernwoorden daarbij zijn: Mechatronica, Internet of things, Big data en Smart industrie. Daarmee zet het bedrijf een flinke stap. Nieuwe Toegevoegde waarde, bovenop haar huidige Picking to Packing concepten.</p>\n\n<p><b>Nieuwsgierig?</b><br>\nAls je meer wilt weten over BergHortimotive, neem een kijkje op <a href=\"http://www.berghortimotive.nl\">www.berghortimotive.nl</a> en bekijk zeker ook even de bedrijfs- en project filmpjes. </p>\n\n<p>BergHortimotive biedt jou als ervaren Software Engineer de gelegenheid producten en systemen steeds meer software matig, geïntegreerd te laten functioneren. Je krijgt een belangrijke rol in de ‘system intergrate’ activiteiten. Een interessante, uitdagende senior software engineer functie waarbij je met andere (software) engineers, met klanten en met leveranciers en marktpartijen samenwerkt. Je komt in een compact platte, efficiënte, slagvaardige en informele organisatie terecht waarbij jij, als je dat ambieert, de aangewezene bent om stap voor stap leiding te geven aan het team van software ontwikkelaars welke er komende tijd bij komen. </p>\n\n<p><b>Meer over het aanbod:</b></p>\n\n<ul>\n<li>Werken met diverse technieken en voor een veelzijdig diverse klanten groep in binnen- en buitenland;</li>\n<li>Een functie bij een prachtig bedrijf met een heldere visie op en een plan voor de toekomst;</li>\n<li>De mooie uitdaging, jouw passie in mechatronica uitgebreid toe te passen;</li>\n<li>Passend salarisniveau, smartphone, laptop en goede secundaire voorwaarden;</li>\n</ul><p><b>Interesse of meer weten?</b><br>\nLeidt jij met BergHortimotive, klanten door de wereld heen binnen naar productiewijzen die bij de Smart Industrie horen? Solliciteer dan snel door je CV en motivatie te sturen via de link. Ook voor vragen of het maken van een afspraak kun je hier terecht. </p>\n\n<p><b><i>Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</i></b><br></p>\n\n<p><i>Trefwoorden: Vacature, fulltime, Rotterdam, senior, software engineer, software developer, softwareontwerper</i></p>",
    "how_to_apply": "<p><a href=\"https://movetocatch.heeft-vacatures.nl/senior_software_engineer_in_de_mechatronica_westland_de_lier/168089/V819/solliciteren\">Klik hier om te solliciteren!</a></p>",
    "company": "BergHortimotive",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/bc5e9d08-a2cc-11e7-8c16-8876620bad2d.jpg",
    "url": "http://jobs.github.com/positions/da937528-a2cc-11e7-9592-e96bff7bc627"
  },
  {
    "id": "9f56bcb2-a2c3-11e7-8bc0-35066792adc4",
    "created_at": "Tue Sep 26 14:05:11 UTC 2017",
    "title": "Cloud Infrastructure Engineer",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p>About the Team</p>\n\n<p>Production Engineering is a new department dedicated to ensuring the reliability and performance of Teach To One: Math across all technology areas. The work of the team includes infrastructure engineering, database administration, tools and automation, bug fixing, troubleshooting, and on-call incident response. This team currently supports our legacy platform built on .NET, Node.js (MEAN), Python (Django), and various front end frameworks. As we complete each piece of our next generation platform built on .NET Core and Angular, Production Engineering is responsible for rolling it out (thus replacing its legacy counterpart) and owning it from that point on.</p>\n\n<p>About the Role</p>\n\n<p>Our Cloud Engineer owns the foundation on which our Teach To One: Math program runs. This person designs, builds, and cares for all of our infrastructure across our cloud providers. Modern services, platforms, tools, networks, systems, and best practices are all core to this role, but so is the ability to see each minute detail in the context of the bigger picture. If you enjoy moving seamlessly between the developer and operations mindsets, and having full support from a management team that gets it (including a former SRE), this job is for you.</p>\n\n<p>What You'll Do</p>\n\n<ul>\n<li>Manage our current infrastructure on Microsoft Azure and Amazon Web Services.</li>\n<li>Design, build, and support our next-generation enterprise cloud infrastructure.</li>\n<li>Create tools to help automate and scale our infrastructure.</li>\n<li>Implement and automate IaaS, PaaS, and serverless services in Azure and AWS including Virtual Machines / EC2, Functions/Lambda, Logic Apps / Step Functions, SQL Database, Data Warehouse, Blob Storage / S3, etc.</li>\n<li>Implement and maintain monitoring solutions such as Graylog 2, New Relic, AppDynamics, and Vault.</li>\n<li>Author and maintain high-quality documentation.</li>\n<li>Troubleshoot and resolve production issues.</li>\n<li>Participate in on-call duty.</li>\n</ul><p>What We Are Looking For</p>\n\n<ul>\n<li>3+ years of hands-on cloud experience with at least 1 year of experience with Microsoft Azure. Strong understanding of Azure capabilities and limitations.</li>\n<li>Deep DevOps and troubleshooting experience with Windows and Linux.</li>\n<li>Deep understanding of code deployment pipelines, continuous integration / continuous delivery systems, and Agile methodology. Experience with deployment strategies using Web Deploy (MSDeploy), Atlassian Bamboo, Git hooks, and triggers.</li>\n<li>Strong knowledge of PowerCLI/PowerShell and bash.</li>\n<li>Experience with Chef or an equivalent configuration management system.</li>\n<li>Extensive knowledge of cloud networking topologies and diagnostics.</li>\n<li>Thorough understanding of infrastructure (hypervisor, storage, monitoring, security, etc.) and experience with cloud deployment orchestration.</li>\n<li>Experience architecting infrastructure solutions using both Linux/Unix and Windows with specific recommendations on servers, load balancing, high availability, disaster recovery, and storage architectures.</li>\n<li>Experience with Active Directory troubleshooting and maintenance. Experience with Azure Active Directory is a plus.</li>\n<li>Expertise in any of our stacks is a plus. Our Teach to One: Math platform runs on .NET, Node.js (MEAN), and Python (Django), all backed by MS SQL Server, MongoDB, and PostgreSQL.</li>\n<li>Exemplary written and verbal communication skills.</li>\n<li>Grace under pressure and a sense of urgency.</li>\n</ul><p>Application Information</p>\n\n<p>Equal Opportunity</p>\n\n<p>All qualified applicants will receive consideration for employment without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality or sex.</p>\n\n<p>Work Authorization</p>\n\n<p>In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification</p>",
    "how_to_apply": "<p>Please submit both your cover letter and resume via our online application system. Incomplete applications will not be considered.</p>\n\n<p>To Apply: <a href=\"https://newclassrooms.bamboohr.com/jobs/view.php?id=229\">https://newclassrooms.bamboohr.com/jobs/view.php?id=229</a></p>",
    "company": "New Classrooms",
    "company_url": "http://NewClassrooms.org",
    "company_logo": "http://github-jobs.s3.amazonaws.com/88e943d2-a2c3-11e7-8a86-65df3de46def.png",
    "url": "http://jobs.github.com/positions/9f56bcb2-a2c3-11e7-8bc0-35066792adc4"
  },
  {
    "id": "bef2e6e8-a2bb-11e7-8142-3defb441995b",
    "created_at": "Tue Sep 26 13:09:18 UTC 2017",
    "title": "Lead Software Engineer in Test",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p>About the Role</p>\n\n<p>The Quality Assurance team at New Classrooms works at the intersection of technology and education. Ensuring the quality and reliability of groundbreaking technology, our Quality Assurance team plays a critical role supporting the constant evolution of our personalized learning model, Teach To One: Math. With a fully-staffed QA team in place, we are now searching for a Lead Software Engineer in Test to develop and provide effective direction and supervision for the team. The ideal candidate will support the QA team with regular testing and implementation tasks and support QA development and performance. He/she will be responsible for both creating test plans for new and legacy products while also leading a team of test engineers in the automation process.</p>\n\n<p>Our Stack</p>\n\n<p>Our technical stack currently includes components that handle data processing, algorithmic decisions, and presentation of information to school users. We run all of our products out of virtual machines and cloud services. Our data is primarily stored in Microsoft SQL Server, and gets published as JSON documents to Azure Blob Storage or MongoDB for speed of access. We have .NET, Node.js, and Python code that each serve particular purposes. Our test automation is powered by a combination of Python, Robot Framework, Selenium, and Wiremock.</p>\n\n<p>About You</p>\n\n<p>You like to chart new territory and quickly absorb new concepts, information, and vocabulary.\nYour friends know you as a puzzle solver who finds all the hidden and stray pieces and ensures they find their correct spot.\nYou fare passionate about innovation and building solutions through automation.\nYou are highly effective in an environment that requires flexibility with your time, expectations, and work queue.\nYou are a strong mentor and you enjoy providing guidance and support to all team members as well as managing through influence across other teams.\nYou are looking for an opportunity to set up and effectively operate QA processes in a data-intense environment.\nThe people who have worked with you describe you as more of a “we” person than an “I person” -- there’s no such thing as “somebody else’s problem” for you.\nYou sweat the small stuff -- you are super detail-oriented and are known for being accurate and precise in your work.</p>\n\n<p>What You Would Do</p>\n\n<p>Team Responsibilities:</p>\n\n<ul>\n<li>Lead the architecture and implementation of test automation.</li>\n<li>Integrate new and legacy products into test framework.</li>\n<li>Integrate test automation into SDLC.</li>\n<li>Extend test frameworks capabilities to fit business needs.</li>\n<li>Establish test plans with clearly defined test objectives for new and legacy products.</li>\n<li>Provide QA estimates to project teams including cost/value trade-offs for depth and breadth of testing.</li>\n<li>Manage and organize a variety of test cases.</li>\n<li>Collaborate with engineers to establish data environments and unique testing methodologies to effectively test back end code.</li>\n<li>Measure quality of products against documented requirements; reach out for clarification/modification of requirements as needed.</li>\n<li>Investigate help desk-reported issues and log validated defects for the engineering queue according to established prioritization process.</li>\n<li>Prepare scenarios for UAT in the appropriate environment when needed.</li>\n<li>Support operations team in post-release monitoring activities.</li>\n</ul><p>Leadership Responsibilities:  </p>\n\n<ul>\n<li>Drive QA practice toward automated testing.</li>\n<li>Mentor and develop team members to continuously build skill sets and improve team effectiveness.</li>\n<li>Maintain individual check-ins, provide opportunities for professional development, and lead team building.</li>\n<li>Partner with business analysts and technical leadership to ensure as much uniformity of standards and processes as possible across teams.</li>\n<li>Lead the strategic planning around resource needs including staffing, testing environments, and work effort allocation.</li>\n<li>Represent QA in all relevant internal committees.</li>\n</ul><p>What We Are Looking For</p>\n\n<ul>\n<li>5+ years working with software development processes and particularly assuring quality of technology products.</li>\n<li>2+ years of people management experience with a demonstrated track record of strong team building and effective mentoring.</li>\n<li>Experience transitioning manual tests to automated tests.</li>\n<li>Strong familiarity with test-driven development fundamentals, including the creation and management of tests using popular testing frameworks and approaches.</li>\n<li>Familiarity with design patterns and when to use them and ability to create tools/applications to aid testing.</li>\n<li>Strong verbal and written communication skills as well as interpersonal skills, with both technical and non-technical colleagues.</li>\n<li>High degree of efficiency and motivation in a challenging, fast-paced environment, including willingness to work off-hours to ensure successful deployments.</li>\n<li>Experience working with REST and SOAP APIs and standard data formats including JSON and XML.</li>\n<li>Comfort and familiarity with a variety of data management tools and languages, such as SQL, Python, etc.</li>\n<li>Proficiency in one or more scripting language, preferably Python.</li>\n<li>Proficiency in relational databases, preferably Microsoft SQL Server or PostgreSQL.</li>\n<li>Proficient understanding of code versioning tools, such as Git.</li>\n<li>Comfort in setting up test data and running SQL queries to confirm quality of code produced data.</li>\n</ul><p>Application Information</p>\n\n<p>Equal Opportunity\nAll qualified applicants will receive consideration for employment without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality or sex.</p>\n\n<p>Work Authorization\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification</p>",
    "how_to_apply": "<p>To Apply</p>\n\n<p>Please submit both your cover letter and resume via our online application system. Incomplete applications will not be considered.</p>\n\n<p>To Apply: <a href=\"https://newclassrooms.bamboohr.com/jobs/view.php?id=225\">https://newclassrooms.bamboohr.com/jobs/view.php?id=225</a></p>",
    "company": "New Classrooms",
    "company_url": "http://NewClassrooms.org",
    "company_logo": "http://github-jobs.s3.amazonaws.com/990ad92c-a2bb-11e7-8225-71b70fcd1c14.png",
    "url": "http://jobs.github.com/positions/bef2e6e8-a2bb-11e7-8142-3defb441995b"
  },
  {
    "id": "d2fba70e-a29a-11e7-9030-c8f80e2688ce",
    "created_at": "Tue Sep 26 09:13:11 UTC 2017",
    "title": "Back End Developer",
    "location": "Eindhoven",
    "type": "Full Time",
    "description": "<p><b>Software Engineer</b>\nEindhoven, Noord-Brabant, Netherlands · Engineering\n</p><p>\n<b>DESCRIPTION</b><br>\nTo support StudyPortals‘ (<a href=\"https://www.studyportals.com/about/\">https://www.studyportals.com/about/</a>) global expansion we are significantly expanding our development team. The team currently consists of Front- and Back-End Developers as well as UX Designers, split over four scrum teams. The technology powering StudyPortals’ platform is based on object-oriented PHP7; virtually all of our systems have been developed in-house. We are currently transitioning into a service-oriented architecture, powered by our own RESTful API. In parallel we are scaling our infrastructure out into AWS in order to get maximum benefit out of the large variety of infrastructure-as-a-service approaches currently offered. As Back-End Developer you will play an important role in further developing and rolling out our RESTful API, which will be at the base of all our current and future products. Your responsibilities range from working on the core of our systems all the way up to producing proof-of-concept web applications. The Front-End Developers will help you to turn your proof-of-concept applications into true “online experiences”. In one sentence, your main purpose is to design &amp; implement functional web interfaces and the full structure behind it. You will work in a multidisciplinary scrum team of about five people, taking input from our graphic designers, UX Designers and our Student- and University Value teams in order to realize the best implementations possible. In order to measure our effectiveness we are currently focusing very hard on our continuous deployment process. Tempted? Get some insight into our company culture by checking out our photos/videos/posts here (<a href=\"https://www.facebook.com/studyportalscareers/\">https://www.facebook.com/studyportalscareers/</a>)\n</p><p>\n<b>REQUIREMENTS</b></p>\n\n<ul>\n<li>At least a Bachelor’s degree, typically in Computer Science or a related field;</li>\n<li>Apart from a proven track-record in creating advanced PHP5 applications, you have some background in stricter, object-oriented, languages such as C# or Java;</li>\n<li>You know your way around a MySQL database and its InnoDB storage-engine;</li>\n<li>The ability to write valid, semantically correct, HTML7 and CSS3;</li>\n<li>Experience with JavaScript, or any other prototyped language, is a big +;</li>\n<li>You understand what it takes to build scalable web applications and realise this means your skills should not be limited to writing good code;</li>\n<li>You are comfortable with collaboration, open communication and reaching across functional borders as part of your day-to-day work;</li>\n<li>Fluency in English, both oral and written, and excellent communication skills;</li>\n<li>Ambition, energetic and an entrepreneurial drive, you can work well independently but definitely also in a team and you are fun to work with.\n<p>\n<b>BENEFITS</b></p>\n</li>\n<li>A fulltime, 40 hours/week, position;</li>\n<li>Competitive salary including a bonus scheme;</li>\n<li>Employee referral bonuses; just an extra chance to work with friends (and earn some extra cash!).</li>\n<li>A +/- 1000 EUR annual personal development budget, because personal growth is KEY!</li>\n<li>An attractive collective insurance package with IAK, covering public and private insurances from healthcare and home insurance to car and liability insurances!</li>\n<li>Reimbursement of your work-related travel costs</li>\n<li>Informal, entrepreneurial, international and flexible atmosphere where self-initiative is highly appreciated;</li>\n<li>Our office is in the centre of Eindhoven (Strijp-S), five minutes from the central station;</li>\n<li>Interesting extras such as a laptop of your choice;</li>\n<li>The opportunity to revolutionize the worldwide study-choice market.\n<p>\n<b><i>No recruitment agencies please.</i></b>\n</p>\n<p>\n<i>Keywords: Job Vacancy, full-time, Eindhoven, C#, Java, MySQL, HTML7, CSS3.</i></p>\n</li>\n</ul>",
    "how_to_apply": "<p>Apply for this job via <a href=\"https://study-portals.redirect.your-jobresponse.com/back_end_developer_eindhoven/168103/V819/apply\">this link</a></p>",
    "company": "StudyPortals",
    "company_url": "https://www.studyportals.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a6bdf1b0-a29a-11e7-9948-5e0ef46b7a0c.png",
    "url": "http://jobs.github.com/positions/d2fba70e-a29a-11e7-9030-c8f80e2688ce"
  },
  {
    "id": "e4873e6a-a296-11e7-88e7-e052d0b37c7d",
    "created_at": "Tue Sep 26 08:49:08 UTC 2017",
    "title": "Java Developer",
    "location": "Maarssen",
    "type": "Full Time",
    "description": "<p><b>Vacature Java Developer</b><br>\nFulltime | Randstad | 2-5 jaar IT-ervaring | zo snel mogelijk starten\u2028</p>\n\n<p>Ben jij klaar voor een nieuwe stap in je carrière als Java Developer? Heb jij de afgelopen jaren de eerste stappen gezet als developer en ben je nu op een punt gekomen waarop je graag kennis op wil gaan doen bij verschillende bedrijven en in verschillende sectoren? Dan zoeken wij jou!</p>\n\n<p>We zoeken voor onze detacheringstak een Java Developer met een passie voor het leveren van hoge kwaliteit oplossingen, die het leuk vind om zich bezig te houden met de meest recente ontwikkelingen binnen het vakgebied en op zoek is naar een nieuwe uitdaging. </p>\n\n<p><b>Wat ga je doen als Java Developer?</b><br>\nAls Java Developer zal je je gaan bezighouden met het implementeren van Java-toepassingen voor bijvoorbeeld backend systemen, websites of mobiele telefoons. Ook ga je je bezighouden met het onderhouden, testen en waar nodig verbeteren van deze toepassingen. Daarnaast wordt van je verwacht dat je in voorkomende gevallen kan optreden als probleemoplosser op het gebied van Java-programmatuur. </p>\n\n<p>Op het moment dat jij in dienst treed bij Calco als Java Developer gaan wij zo snel mogelijk voor je op zoek naar een uitdagende opdracht bij een van onze vele opdrachtgevers. Daarnaast bieden we je de mogelijkheid om je te kunnen blijven ontwikkelen binnen je vakgebied en gaan we aan de hand van jouw ambitie samen een ontwikkelplan opstellen.</p>\n\n<p><b>Functie-eisen</b><br>\nMust-haves:  </p>\n\n<ul>\n<li>Hbo/wo werk- en denkniveau<br>\n</li>\n<li>Minimaal 2 jaar werkervaring met Java en verwante technieken, frameworks en tools<br>\n</li>\n<li>Ervaring met databases<br>\n</li>\n<li>Agile / Scrum ervaring<br>\n</li>\n<li>Uitstekende beheersing van de Nederlandse taal</li>\n</ul><p>Nice-to-haves:  </p>\n\n<ul>\n<li>Kennis van HTML, CSS en Javascript<br>\n</li>\n<li>Kennis van cloud<br>\n</li>\n<li>Android kennis<br>\n</li>\n<li>Angular kennis<br>\n</li>\n<li>CI/CD kennis<br>\n</li>\n</ul><p><b>\u2028Jouw talenten\u2028</b><br>\nJij bent:  </p>\n\n<ul>\n<li>Pragmatische en proactief</li>\n<li>Analytisch en leergierig, je houdt ervan om complexe problemen op te lossen en geen uitdaging is voor jou te groot</li>\n<li>Een echte teamplayer</li>\n<li>Iemand met een agile mindset</li>\n<li>Verantwoordelijk, je durft ook de vragen te stellen die niemand anders durft te stellen</li>\n<li>Bovengemiddeld communicatief vaardig. Naast de IT kennis die jij hebt, voeg jij ook veel toe met je sociale en communicatieve skills</li>\n<li>Daarnaast vind je het leuk om kennis te delen met collega’s en junioren. Een pizzasessie organiseren? Leuk!</li>\n</ul><p><b>Waarom werken voor Calco?</b><br>\nCalco is gespecialiseerd in het opleiden, detacheren en coachen van (young) IT professionals. Wij helpen onze opdrachtgevers aan de beste IT medewerkers, dit zijn stuk voor stuk ambitieuze, talentvolle professionals die iedere dag het verschil maken.</p>\n\n<p>Bij Calco staat oneindige groei centraal. We vinden het belangrijk om in onze medewerkers te investeren en weten door onze jarenlange ervaring in opleiden en coachen als geen ander hoe we hen kunnen ondersteunen bij hun persoonlijke én professionele ontwikkeling.</p>\n\n<p>Onze medewerkers werken voor Nederlandse top bedrijven in uiteenlopende opdrachten. Van project managers tot DevOps engineers, ontwikkelaars en Scrum Masters, wij helpen onze professionals aan hun volgende uitdaging. Door onze persoonlijke benadering en aandacht voor persoonlijkheid, competenties en ambities, maken wij altijd de juiste match. </p>\n\n<p>Daarnaast bieden wij jou:</p>\n\n<ul>\n<li>Volop ruimte om jezelf te ontwikkelen en opleidingen/cursussen te volgen<br>\n</li>\n<li>Een fieldmanager die jou coacht en begeleidt in jouw ontwikkeling<br>\n</li>\n<li>Een gezellige werkomgeving met gemotiveerde collega’s<br>\n</li>\n<li>Interessante en leuke personeelsevenementen zoals Technische Meetings, Personeelsvergaderingen, het jaarlijkse gala en vrijdagmiddagborrels<br>\n</li>\n<li>Mogelijkheden om mee te denken met de groei en ontwikkeling van Calco<br>\n</li>\n<li>Een marktconform salaris afhankelijk van kennis en ervaring<br>\n</li>\n<li>Een leaseauto of ov-jaarkaart<br>\n</li>\n</ul><p><b>Sollicitatieprocedure</b><br>\nHet selectieproces start met het toesturen van jouw sollicitatie en ziet er als volgt uit:  </p>\n\n<ul>\n<li>Beoordeling CV en motivatiebrief<br>\n</li>\n<li>Analytische test<br>\n</li>\n<li>Online persoonlijkheidsassessment<br>\n</li>\n<li>1e Sollicitatiegesprek<br>\n</li>\n<li>2e Sollicitatiegesprek<br>\n</li>\n</ul><p><b>Interesse?\u2028</b><br>\nBen jij dus toe aan de volgende stap in jouw carrière? En wil jij werken voor grote toonaangevende bedrijven in Nederland? Solliciteer dan via deze link:</p>\n\n<p><b><a href=\"https://calcoflex.redirect.your-jobresponse.com/java_ontwikkelaar_maarssen/168077/V819/solliciteren\">Klik hier voor het sollicitatieformulier!</a></b></p>\n\n<p>We ontvangen graag je cv én motivatiebrief. Let op! Sollicitaties zonder motivatiebrief worden niet in behandeling genomen.Heb je nog vragen? bel onze recruiter Lotte Wilmer op 085 273 2720</p>\n\n<p><b><i>Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</i></b></p>\n\n<p>Vacature, Fulltime, Utrecht, Java ontwikkelaar, Software Development, IT.</p>",
    "how_to_apply": "<p><b><a href=\"https://calcoflex.redirect.your-jobresponse.com/java_ontwikkelaar_maarssen/168077/V819/solliciteren\">Klik hier voor het sollicitatieformulier!</a></b></p>",
    "company": "Calco Flex",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/d4e59786-a296-11e7-971c-84f4bb813991.png",
    "url": "http://jobs.github.com/positions/e4873e6a-a296-11e7-88e7-e052d0b37c7d"
  },
  {
    "id": "b9577646-a292-11e7-8173-20dc4c57f704",
    "created_at": "Tue Sep 26 08:16:12 UTC 2017",
    "title": "Paktor - Web Developer",
    "location": "Singapore, Remote",
    "type": "Full Time",
    "description": "<p>Company Information:</p>\n\n<p>Paktor was founded with the mission of connecting singles in Asia through technology- enabled platforms. Since its founding in 2013, Paktor Group has expanded beyond Singapore to the rest of Southeast Asia and North Asia, becoming the largest social dating group in the region. The company merged with the Taiwan-based firm to form M17 Entertainment, the leading social entertainment company in the region. Along with its other acquisitions in social dating such as Down, Inc and Goodnight, the group’s social entertainment and dating assets jointly account for over 20 million users in Asia.</p>\n\n<p>Paktor is backed by institutional investors including Vertex Ventures (subsidiary of Temasek), Majuven, Convergence Ventures, Infinity Venture Partners and Yahoo Japan.</p>\n\n<p>Responsibility</p>\n\n<p>Looking to find an experienced frontend web developer who is able to develop a RESTful web based app with Angular and React to connect with our backend. The web app's functionality would be powered by our existing RESTful Web API. For backend we use Java, Firebase and Google Cloud Services.</p>\n\n<ul>\n<li>   Strong experience with JavaScript Fundamentals.</li>\n<li>   Strong experience with React / Angular.js / Node.js </li>\n<li>   Good projects showcase / Tech Blog / Open Source Contributions</li>\n<li>   Expert at architecting apps for scalability and performance</li>\n<li>   Expert at HTML5, CSS, SASS, Flexbox</li>\n<li>   SQL</li>\n<li>   Experience working in an Agile environment</li>\n<li>   A sense of good UX principles</li>\n<li>   Experience with modern tools: Webpack, Babel, Redux, Docker</li>\n<li>   Experience with Google Cloud Services is a plus.</li>\n</ul><p>Bonus points if you have:</p>\n\n<ul>\n<li>      A BS/MS in Computer Science or Engineering from a top school, but a wonderful project list trumps all</li>\n<li>Prior start-up experience is awesome (not necessary); being scrappy will help you hit the ground running.</li>\n</ul>",
    "how_to_apply": "<p>Do send in your resume to</p>\n\n<p><a href=\"mailto:recruitment@gopaktor.com\">recruitment@gopaktor.com</a> / <a href=\"mailto:jessicasee@gopaktor.com\">jessicasee@gopaktor.com</a> and title it as Application for Web Developer,</p>\n\n<p>Kindly state your expected Salary [Currency].</p>\n\n<p>Do let us know if you will like to relocate to Singapore or working remotely</p>\n\n<p>Thanks</p>\n\n<p>Only selected candidates will be notify.</p>",
    "company": "Paktor Pte Ltd",
    "company_url": "http://gopaktor.com/index.html#/home",
    "company_logo": "http://github-jobs.s3.amazonaws.com/7e9df2fa-a292-11e7-959f-434da6769816.png",
    "url": "http://jobs.github.com/positions/b9577646-a292-11e7-8173-20dc4c57f704"
  },
  {
    "id": "08edfdda-a237-11e7-8fa2-da75ecc6d507",
    "created_at": "Mon Sep 25 21:19:49 UTC 2017",
    "title": "Full Stack Software Engineer",
    "location": "(Remote or Boston)",
    "type": "Full Time",
    "description": "<h3>About Us</h3>\n\n<p>Forward Financing is a fast-growing company in the alternative small business\nfinancing industry based in Boston's Financial District.  As a matter of fact,\nthe Boston Business Journal just named us the 2nd fastest growing private\ncompany in Massachusetts over the last three years.   Founded in 2012, we strive\nto provide small business owners the financial access they need to capitalize\nand expand on their businesses with ease of mind. With a proven business model,\nand led by an experienced executive team, we've funded over 3,000 small\nbusinesses with working capital.</p>\n\n<p>We are looking for an experienced full stack software engineer to help us \npush the boundaries of our current technology ecosystem so we can better serve,\nand help, our merchants.</p>\n\n<p>We offer a comprehensive benefits package including: health, dental, vision,\nSTD, LTD and life insurance. We also offer commuting benefits, 401K match and\nreimburse gym membership.  You will have the opportunity to work with people\nthat enjoy a fun, social culture.</p>\n\n<h3>Technical Qualifications</h3>\n\n<p><em>Required</em> </p>\n\n<ul>\n<li>Full-stack experience</li>\n<li>At least 2 years of experience with Ruby on Rails (or other MVC framework) in\na production environment.</li>\n<li>At least 1 year of previous experience working remotely.</li>\n<li>Experience with React and other JS frameworks.</li>\n<li>Experience with crafting and implementing test design strategies.</li>\n<li>A team player that collaborates and communicates well.</li>\n<li>Knowledge of SQL</li>\n<li>Proven ability to complete complex, time sensitive projects successfully as\nan individual contributor or as part of a team</li>\n</ul><p><em>Preferred</em></p>\n\n<ul>\n<li>Experience with Phoenix/Elixir in a production environment.</li>\n<li>Experience with React, testing strategies, and deployment strategies.</li>\n<li>Experience working in an Agile like environment</li>\n</ul>",
    "how_to_apply": "<p>Please submit your resume to <a href=\"http://forwardfinancinginc.applytojob.com/apply/gYv1BUKzvJ/Software-Engineer-Web-Local-Or-Remote\">http://forwardfinancinginc.applytojob.com/apply/gYv1BUKzvJ/Software-Engineer-Web-Local-Or-Remote</a></p>",
    "company": "Forward Financing",
    "company_url": "https://www.forwardfinancing.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/ef122490-a236-11e7-9df7-babaf7e13cad.png",
    "url": "http://jobs.github.com/positions/08edfdda-a237-11e7-8fa2-da75ecc6d507"
  },
  {
    "id": "aaef4e5e-a205-11e7-8219-289cde1b1a77",
    "created_at": "Mon Sep 25 15:25:32 UTC 2017",
    "title": "Interactive Media Technology Programmer",
    "location": "Edwardsville, Illinois",
    "type": "Full Time",
    "description": "<p>Southern Illinois University Edwardsville (SIUE) is in a national search for an Interactive Media Technology Programmer.</p>\n\n<p>About us:</p>\n\n<p>Situated on 2,660 acres of beautiful woodland atop the bluffs overlooking the natural beauty of the Mississippi River’s rich bottom land and only a short drive from downtown St. Louis, SIUE is a nationally recognized university that provides students with a high-quality, affordable education that prepares them for successful careers and lives of purpose.</p>\n\n<p>The SIUE campus is home to a diverse group of 14,000+ students and over 2,400 staff members. Our community, peers and students recognize our momentum and view SIUE as an institution that's raising the bar. Every day, we are researching, sharing knowledge and making a difference in the lives of our students. Join the adventurous minds here at SIUE that are changing the world; explore this exciting employment opportunity today!</p>\n\n<p>About the job:</p>\n\n<p>The Interactive Media Technology Programmer will work directly with the Associate Director for Web Strategy in recommending and/or implementing interactive technologies. The Programmer will use coding languages, authoring tools, mark-up languages and scripting to create the product. He or she may, for example, develop online applications/systems/website or functionality as part of an interactive media product. In the case of web-based products, this will sometimes mean the Programmer will manage servers, program code and databases that run on the web server in whole or part of an online system or application and/or recommend already existing systems and develop strategies to implement. Additionally, the Interactive Media Technology Programmer will also manage, test and maintain those systems/applications (this includes but is not limited to the SIUE CMS) in addition to providing training/support when appropriate.</p>\n\n<p>Qualifications:</p>\n\n<ol>\n<li> Bachelor's degree from an accredited university in communications, digital media, computer or information science, or related field and demonstrated effectiveness in online application/website/system/database programming development, strategy, planning and execution.</li>\n<li> Programming experience with (years can be concurrent):\n HTML (2-4 years of experience)<br>\n CSS (1-3 years of experience)<br>\n Javascript (1-3 years of experience)\nPreferred Qualifications:\n-Must have some professional experience with responsive design. \n-Master's degree from an accredited institution in communication,  digital media, computer or information science, and demonstrated effectiveness in online application/website/system/database programming development, strategy, planning and execution. \n-Programming experience in any of the following: JQuery, PHP, Database Management/Implementation (MySQL) and Cascade Server (XSLT and Velocity). </li>\n</ol><p>Southern Illinois University Edwardsville is an Equal Opportunity Employer committed to an inclusive and diverse workforce. We will not discriminate against any person on the basis of race, national origin, religion, disability, age, marital status, sex, sexual orientation or veteran’s status. We encourage applications from women, minorities, protected veterans and people with disabilities.</p>",
    "how_to_apply": "<p>Applicants must apply online at: <a href=\"https://siue.hiretouch.com/cs-current-vacancies/cs-current-vacancies-job-details?jobID=6168&amp;job=information-technology-technical-associate-interactive-media-technology-programmer-6168\">https://siue.hiretouch.com/cs-current-vacancies/cs-current-vacancies-job-details?jobID=6168&amp;job=information-technology-technical-associate-interactive-media-technology-programmer-6168</a></p>\n\n<p>Applicants must submit a Civil Service application (required), a detailed resume, and unofficial transcripts, including those for SIUE, through HireTouch. Your resume should reflect all relevant skills and experience related to the minimum qualifications listed for this position. If qualifying by education, you must submit your transcripts, including those for SIUE, at the time of application. Applicants qualifying for Veteran’s preference must submit a copy of form DD214 at the time of application. For additional information, please visit: Eligibility Criteria and Point Allocation and Proof of Eligibility.   Please submit any other licenses or certifications related to the position at the time of application.</p>\n\n<p>For Civil Service positions, Illinois residency is required within 180 calendar days of the start date for the designated position.</p>\n\n<p>Applicants will be subject to a background check and/or drug screening prior to an offer of employment.</p>",
    "company": "Southern Illinois University Edwardsville",
    "company_url": "http://www.siue.edu/employment",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a08aeed2-a205-11e7-86a2-889841422c08.jpg",
    "url": "http://jobs.github.com/positions/aaef4e5e-a205-11e7-8219-289cde1b1a77"
  },
  {
    "id": "2426ebf6-e641-11e5-8030-461e4e18f3ad",
    "created_at": "Mon Sep 25 12:58:07 UTC 2017",
    "title": "Experienced Backend / Full Stack Engineer",
    "location": "Remote",
    "type": "Full Time",
    "description": "<p><a href=\"https://citrusbyte.com\">Citrusbyte</a> is a software consultancy that believes in using simple tools to solve problems. We build custom systems for both startups and enterprises - You can see our <a href=\"https://citrusbyte.com/portfolio\">portfolio</a> for more information about our clients.</p>\n\n<p>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</p>\n\n<p>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</p>\n\n<p>Most of our projects are written in <strong>Ruby</strong>, so experience in this language is required, but we are looking for polyglot engineers who have a hunger for learning new languages and tools. At Citrusbyte, learning is part of the job, and you should always be able to answer the question: \"what have I learned this week?\"</p>\n\n<p>We believe that less is more and we vehemently value simplicity. This is reflected in the tools we choose to work with. For this reason we tend to avoid using big frameworks like Ruby on Rails and instead lean towards smaller tools like Sinatra, Roda or Cuba.</p>\n\n<p>We have also done projects in <strong>Elixir</strong>, <strong>Node</strong>, <strong>Go</strong>, <strong>Python</strong>, <strong>Lua</strong>, etc. And strive to learn new tools and languages everyday. We believe in always choosing the right tool for the job and we are very open minded about trying different technologies.</p>\n\n<h3>Skills &amp; Requirements:</h3>\n\n<ul>\n<li>Smart, gets things done.</li>\n<li>Passionate about software development.</li>\n<li>Excellent communication / consulting experience.</li>\n<li>Open minded and always learning</li>\n<li>Experience working in a distributed company</li>\n</ul><h3>Duties &amp; Responsibilities:</h3>\n\n<ul>\n<li>Architect and build web applications.</li>\n<li>Work with product designers and clients to clarify requirements.</li>\n<li>Plan and prioritize work in a collaborative remote team.</li>\n</ul>",
    "how_to_apply": "<p>You can apply directly on our <a href=\"https://goo.gl/ED54uY\">careers page</a></p>",
    "company": "Citrusbyte",
    "company_url": "https://citrusbyte.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/f9c13b32-e640-11e5-9749-ea3708a49aac.png",
    "url": "http://jobs.github.com/positions/2426ebf6-e641-11e5-8030-461e4e18f3ad"
  },
  {
    "id": "d9983c7c-3999-11e7-8222-72f96992a639",
    "created_at": "Mon Sep 25 07:36:30 UTC 2017",
    "title": "Senior Product Engineer (Ruby + JavaScript)",
    "location": "Amsterdam/Remote",
    "type": "Full Time",
    "description": "<p>Senior Product Engineer (full-time+remote).</p>\n\n<p>Deliver value every day and have an impact on the world!</p>\n\n<p>Our mission is simple: we want to revolutionize digital catalogs. That’s why we’re dedicated to building a beautiful web app with meticulous attention to quality. Working from our office in Amsterdam, we use many technologies (JS (Node, React, Backbone, Redux), Ruby (RoR)) to change the catalog forever. We believe in getting things done, making decisions fast, and not wasting time in endless meetings. We do this by listening to our customers, checking the data, and trusting our gut.</p>\n\n<p>Everyone in our development team works together and contributes to the success of our product, including UX designer and product manager. The engineer that we’re looking for is pragmatic, loves to get things done and has a strong focus on results. We promise to get rid of everything that stands in your way so you can create your best work. If this sounds like your kind of place, it’s time to get in touch.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Performance, stability and scalability of our stack</li>\n<li>Product development</li>\n<li>Contributing to our development, product and design strategy</li>\n</ul><p>Skills:</p>\n\n<ul>\n<li>Proactively solving challenges</li>\n<li>Delivering features end to end</li>\n<li>Designing and implementing back-end and front-end architecture</li>\n<li>Deployment architecture and distributed job processing</li>\n<li>Single page JavaScript apps</li>\n<li>Cross-browser compatibility</li>\n<li>Mobile browser performance</li>\n<li>Writing specs/tests</li>\n<li>Ruby on Rails</li>\n<li>React + Redux</li>\n<li>Node.js</li>\n<li>AWS</li>\n<li>Modern JS (ES2005+)</li>\n<li>CoffeeScript</li>\n<li>Backbone.js</li>\n<li>PostgreSQL</li>\n<li>English</li>\n</ul><p>What can you expect from us?</p>\n\n<ul>\n<li>€3,300-€4,600 gross salary per month</li>\n<li>8% holiday bonus paid in May</li>\n<li>25 paid vacation days</li>\n<li>A contract of indefinite duration</li>\n<li>Option to work remotely</li>\n<li>Free organic lunch</li>\n<li>We'll cover your travel expenses</li>\n<li>Unlimited budget for the Kindle Store and Apple App Store</li>\n<li>A remarkable company culture</li>\n<li>4 team retreats per year </li>\n<li>A great working environment in the center of Amsterdam</li>\n<li>We will challenge and support you to get the most out of your potential</li>\n<li>Equity plan (to be launched soon)</li>\n<li>30% tax ruling (for candidates outside of the NL)</li>\n<li>Visa sponsorship possibilities for candidates outside of the EU</li>\n</ul>",
    "how_to_apply": "<p><a href=\"http://jobs.publitas.com/o/senior-product-engineer/c/new\">http://jobs.publitas.com/o/senior-product-engineer/c/new</a></p>",
    "company": "Publitas",
    "company_url": "https://www.publitas.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/c904fdf0-3999-11e7-9154-369f282201cb.png",
    "url": "http://jobs.github.com/positions/d9983c7c-3999-11e7-8222-72f96992a639"
  },
  {
    "id": "f1d56d62-a0a2-11e7-8971-5a5e18c19bb0",
    "created_at": "Sat Sep 23 21:13:15 UTC 2017",
    "title": "CTO / Senior Tech Lead",
    "location": "São Paulo",
    "type": "Full Time",
    "description": "<p><strong>Who are we and why is software engineering important to us?</strong></p>\n\n<p>Revelo is one of the brands of a Series A funded technology startup looking for a Senior Tech Lead to run a team of web developers responsible for all client facing features.</p>\n\n<p>We are working in the recruiting industry and are backed by some of the largest names in recruiting technology world-wide.</p>\n\n<p>We are a technology company, and software engineers are the core of our company.\nThe initial team are all analytical data driven thinkers – we value a fast moving highly analytical approach to work.</p>\n\n<p>Note: This is a Brazil based Portuguese speaking company - this ad is written in English as we also accept international candidates.</p>\n\n<p><strong>Who we are looking for?</strong></p>\n\n<p>We are looking for someone who can play an active role in setting a technical direction for the team, recruiting and building a team, and guiding and helping the newer members of the team to learn and grow in their roles.</p>\n\n<p>Beyond leading the team, you will spend a large portion of your time writing and shipping code.</p>\n\n<p>You have experience leading or playing a senior role in a high performing web development team.</p>\n\n<p>We are open to people with other experience however knowledge in Ruby on Rails is a large positive.</p>\n\n<p>You are able to understand the input from designers, product managers, and the business units, and help to prioritize technical tasks in a logical and reasonable way.</p>\n\n<p>You have an academic degree in computer science/engineering (or equivalent).</p>\n\n<p>You love technology and love finding areas where you can push the business forward using technology.</p>\n\n<p><strong>What are some examples of problems this Senior Tech Lead will solve?</strong></p>\n\n<ul>\n<li>  Planning the architecture of the application to optimize for reliability, speed, and flexibility</li>\n<li>  Improving performance of the application</li>\n<li>  Helping define tech-team processes</li>\n<li>  Creating systems that predict what the user wants based on many inputs and presenting them with the easiest way to do so.</li>\n<li>  Interfacing with other departments in the business to understand their problems and develop the best technical solution </li>\n<li>  Helping the product manager prioritize the backlog of the development team. </li>\n<li>  Managing a team of developers but still writing code every day. </li>\n<li>  Delivering intuitive and beautiful interfaces for complex systems.</li>\n<li>  Helping to improve our search, recommendation and matching features</li>\n<li>  Recommending the best technical approach for product ideas (eg. developing a mobile strategy)</li>\n</ul><p><strong>​Benefits:</strong></p>\n\n<ul>\n<li>  Lunch allowance (VR)</li>\n<li>  Health Plan</li>\n<li>  Free beers twice a month</li>\n<li>  Informal fast moving atmosphere</li>\n<li>  Work on a product that helps you and your friends</li>\n</ul>",
    "how_to_apply": "<p>Apply here: <a href=\"https://revelo.workable.com/j/06E0E47FFD\">https://revelo.workable.com/j/06E0E47FFD</a></p>",
    "company": "Revelo",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/b484ba80-a0a2-11e7-827b-830380285d55.png",
    "url": "http://jobs.github.com/positions/f1d56d62-a0a2-11e7-8971-5a5e18c19bb0"
  },
  {
    "id": "cbd389e4-9ff5-11e7-9e4b-fb1495b42115",
    "created_at": "Sat Sep 23 00:26:35 UTC 2017",
    "title": "Developer - AWS, IoT, & Other Cool Stuff",
    "location": "Naperville, IL (Or Remote)",
    "type": "Full Time",
    "description": "<p>Grid Connect is a growing, networking products manufacturer focused on building awesome connected devices for the companies big and small. In addition to building custom Internet of Things (IoT) enabled hardware and software for our clients also build our own smart home products under the ConnectSense brand.</p>\n\n<p>Grid Connect is looking for a talented developer to help strengthen our team. \nThe ideal candidate is a fast learner, is excited about programming, has great communication skills and is able to hit the ground running on multiple projects. </p>\n\n<h1>Desired skills include:</h1>\n\n<ul>\n<li>2-3 years of programming experience or more</li>\n<li>Building and maintaining awesome software</li>\n<li>Agile development and methodologies </li>\n<li>Rapid deployment and test-driven development </li>\n<li>GIT Experience</li>\n</ul><p> </p>\n\n<h1>Nice to have skills:</h1>\n\n<ul>\n<li>Experience with Node.js</li>\n<li>AWS Development Experience (Serverless/Lambda, DynamoDB, etc)</li>\n<li>Experience with Pair programming (Or open to it) </li>\n<li>iOS experience</li>\n</ul><p>Grid Connect is a 14-year-old company focused on building and distributing excellent networking products. Our team mainly works out of our Naperville, Illinois office. While we prefer candidates who live and work in the Chicagoland area we are open to exceptional remote employees.</p>\n\n<p>In our spare time at Grid Connect, we enjoy playing Ping-Pong, spirited Bags matches in the summer and contributing to open source projects. In addition to a competitive salary, company benefits include paid medical, 401K with matching, weekly free lunches, bi-weekly massages, ample paid time off including your birthday, expenses paid for conferences and other learning opportunities and a budget for personal technology.</p>",
    "how_to_apply": "<ul>\n<li>-Send an Email to hiring@gridconnect.com </li>\n<li>-Email Subject line should be \"I Love Developing Cool Stuff\" </li>\n<li>-Attach a cover letter stating why you are passionate about Software Development, why you would like to work at Grid Connect, and anything else you would like us to know about you. </li>\n<li>-Attach a copy of your resume </li>\n<li>-Include a link to your GitHub account</li>\n</ul>",
    "company": "Grid Connect",
    "company_url": "https://gridconnect.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/2e2caa96-9ff4-11e7-87ad-20708137dd2b.jpg",
    "url": "http://jobs.github.com/positions/cbd389e4-9ff5-11e7-9e4b-fb1495b42115"
  },
  {
    "id": "ef0dea9c-9fcf-11e7-91c6-eedf4c742eb3",
    "created_at": "Fri Sep 22 19:55:52 UTC 2017",
    "title": "Senior Android Engineer",
    "location": "Renton, WA",
    "type": "Full Time",
    "description": "<p>The Digital Innovation Group (DIG) at Providence Health &amp; Services is a small but mighty product development and incubation team that is building next-gen tools that give patients convenient and easy access to healthcare virtually anywhere, anytime.</p>\n\n<p>We are looking for a Senior Android Engineer to help us transform Healthcare through technology by creating smart, sophisticated, user-centric, and sustainable apps. If you want to solve complex problems that make clear and real-world impact in people’s lives, join us!</p>\n\n<p>What you’ll work on:\nYour work will change healthcare as we know it. You will be building the software that powers the On-Demand-Healthcare Platform, eXpressCare and TeleHealth products (TeleHospitalist, TeleStroke, TelePsych).</p>\n\n<p>How you’ll be doing this:</p>\n\n<ul>\n<li>Apply expertise in software technology to improve the health care experience for both patients and providers.</li>\n<li>Work with customers, designers and UX experts to design and develop solutions to challenging problems, leading teams and mentoring more junior engineers.</li>\n<li>Provide thought leadership in software engineering, bringing to bear your experience in the industry and your desire to keep learning new things.</li>\n<li>Take calculated risks, learn from success or failure, and apply that to the next problem in the pipeline.</li>\n<li>Do all this in a way that respects team work, diversity of opinion, and maintains our organization’s mission (Know Me, Care for Me, Ease My Way), and core values of Respect, Compassion, Justice, Excellence and Stewardship.</li>\n</ul><p>Qualifications:\nBring us your expertise:</p>\n\n<ul>\n<li>3 experience on the Android Platform including a passion for new technology and mobile applications</li>\n<li>4 years of object-oriented programming experience</li>\n<li>Demonstrated application development, preferably live in an app store</li>\n<li>A solid software development foundation including competencies in data structures, algorithms and software design</li>\n<li>Continuous delivery</li>\n<li>A demonstrated track record of being a change agent, leaving every team and process better than you found it</li>\n</ul><p>We offer:</p>\n\n<ul>\n<li>A small but growing team - we’re good at what we do and enjoy working together.</li>\n<li>Autonomy and respect from day one</li>\n<li>An environment that is scrappy, flexible, and values tenacity</li>\n<li>Great pay</li>\n<li>Generous vacation, benefits, flexible work, and matched 403b</li>\n<li>The best tools money can buy</li>\n</ul><p>What else:\nYou’ll be surrounded by a team of people who have transformed industries and have come to Providence to transform health care delivery. You will have the best of both worlds- the exhilaration of an incubation organization paired with the resources and security of an industry healthcare leader.</p>\n\n<p>OUR MISSION:\nAs employees of the Providence Digital Innovation Group, we passionately serve the people of our community. We are dedicated to removing obstacles that limit access to quality health care and enabling people to live healthier lives.</p>\n\n<p>We offer a full comprehensive range of benefits - see our website for details\n<a href=\"http://www.providenceiscalling.jobs/rewards-benefits/index.html\">http://www.providenceiscalling.jobs/rewards-benefits/index.html</a></p>\n\n<p>About Us\nProvidence Health &amp; Services is the third largest not-for-profit health system in the United States. Providence employs more than 76,000 caregivers (employees) across a five-state area; AK, WA, MT, OR, and CA. Our facilities include 34 hospitals, 475 physician clinics, senior services, supportive housing and other health and educational services. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.</p>\n\n<p>Answer the call.  Providenceiscalling.jobs\nWhen applying online, please reference job number 152252.</p>\n\n<p>Apply online:\n<a href=\"http://50.73.55.13/counter.php?id=110126\">http://50.73.55.13/counter.php?id=110126</a></p>\n\n<p>Providence Health &amp; Services is an equal opportunity employer who provides competitive benefits, a drug-free workplace and supports work/life balance.</p>",
    "how_to_apply": "<p>Answer the call.  Providenceiscalling.jobs\nWhen applying online, please reference job number 152252.</p>\n\n<p>Apply online:\n<a href=\"http://50.73.55.13/counter.php?id=110126\">http://50.73.55.13/counter.php?id=110126</a></p>",
    "company": "Providence Health & Services",
    "company_url": "http://www.providence.org",
    "company_logo": "http://github-jobs.s3.amazonaws.com/e0a2f664-9fcf-11e7-9591-a5dc171a5db5.jpg",
    "url": "http://jobs.github.com/positions/ef0dea9c-9fcf-11e7-91c6-eedf4c742eb3"
  },
  {
    "id": "9e1859e2-9fcf-11e7-8be0-d433cbe2c28b",
    "created_at": "Fri Sep 22 19:53:32 UTC 2017",
    "title": "Software Engineering Manager, API ",
    "location": "Renton, WA",
    "type": "Full Time",
    "description": "<p>The Digital Innovation Group (DIG) at Providence Health &amp; Services is a small but mighty product development and incubation team that is building next-gen tools that give patients convenient and easy access to healthcare virtually anywhere, anytime.</p>\n\n<p>We are looking for a Software Engineering Manager to act as the anchor for building a top-tier software organization that will transform health care through technology that is smart, sophisticated, user-centric, and cool. We’re building a team and a culture that respects the craft of software engineering, applying our expertise to problems that really matter.</p>\n\n<p>If you want to solve complex problems that make clear and real-world impact in people’s lives, join us!</p>\n\n<p>What You Will Work On:\nYour work will change healthcare as we know it. You will be building the software that powers the Providence On-Demand-Healthcare Platform, eXpressCare and TeleHealth products.</p>\n\n<p>The Software Engineering Manager will:\n• Lead team(s) of world-class software engineers and make the right design decisions and technology choices.\n• Be a hands-on engineering team manager who will spend up to 50% of their time in the codebase, own production needs, and manage project execution.\n• Build and manage team(s) that designs and delivers scalable, extensible complex distributed systems.\n• Provide coaching and leadership in software best practices, automated test strategies, and work toward flattening the cost of change curve for our software products and services.\n• Manage resources, staff, mentoring and growing a best of class engineering team.\n• Understand overall systems development life cycle including various methodologies.\n• Develop the long-term strategy for technology platforms that translate into an achievable roadmap.\n• Scope and justify resources and budget needs to leadership\n• Achieve operational excellence of your system.\n• Work with open source technologies, object-oriented design, and agile development methodologies.\n• Deliver products that delight customers while managing the health of the code base through continuous refactoring and management of technical debt.\n• Appreciate and advocate for information security and secure coding practices.</p>\n\n<p>We Offer\n• A small but growing team - we’re good at what we do and enjoy working together\n• Autonomy and respect from day one\n• An environment that is scrappy, flexible, and values tenacity\n• Great pay\n• Generous vacation, benefits, flexible work, and matched 403b\n• The best tools money can buy</p>\n\n<p>You’ll be surrounded by a team of people who have transformed industries and have come to Providence to transform health care delivery. You will have the best of both worlds- the exhilaration of an incubation organization paired with the resources and security of an industry healthcare leader.</p>\n\n<p>Qualifications:\n• An M.S. in Computer Science, Engineering, or an equivalent combination of education and relevant experience.\n• 8 years of software development experience, shipping enterprise grade software, using multiple languages and frameworks.\n• 2 years of experience as a hands-on engineering team manager.\n• Demonstrated track record leading geographically dispersed teams.\n• Your skills are language, framework, and toolset agnostic.\n• Experience with full stack SaaS development.\n• Experience with advanced web applications.\n• Experience with API development in service and resource-oriented architectures.\n• Experience with large complex databases and data quality and lifecycle issues.\n• Experience with mobile applications a plus.\n• A demonstrated track record of being a change agent, leaving every team and process better than you found it.</p>\n\n<p>Our Mission\nAs employees of the Providence Digital Innovation Group, we passionately serve the people of our community. We are dedicated to removing obstacles that limit access to quality health care and enabling people to live healthier lives.</p>\n\n<p>We offer a full comprehensive range of benefits - see our website for details\n<a href=\"http://www.providenceiscalling.jobs/rewards-benefits/index.html\">http://www.providenceiscalling.jobs/rewards-benefits/index.html</a></p>\n\n<p>About Us\nProvidence Health &amp; Services is the third largest not-for-profit health system in the United States. Providence employs more than 76,000 caregivers (employees) across a five-state area; AK, WA, MT, OR, and CA. Our facilities include 34 hospitals, 475 physician clinics, senior services, supportive housing and other health and educational services. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.</p>\n\n<p>Answer the call.  Providenceiscalling.jobs\nWhen applying online, please reference job number 159487.</p>\n\n<p>Apply online:\n<a href=\"http://50.73.55.13/counter.php?id=110125\">http://50.73.55.13/counter.php?id=110125</a></p>\n\n<p>Providence Health &amp; Services is an equal opportunity employer who provides competitive benefits, a drug-free workplace and supports work/life balance.</p>",
    "how_to_apply": "<p>Answer the call.  Providenceiscalling.jobs\nWhen applying online, please reference job number 159487.</p>\n\n<p>Apply online:\n<a href=\"http://50.73.55.13/counter.php?id=110125\">http://50.73.55.13/counter.php?id=110125</a></p>",
    "company": "Providence Health & Services",
    "company_url": "http://www.providence.org",
    "company_logo": "http://github-jobs.s3.amazonaws.com/99e12034-9fcf-11e7-884c-7f7ad27ef358.jpg",
    "url": "http://jobs.github.com/positions/9e1859e2-9fcf-11e7-8be0-d433cbe2c28b"
  },
  {
    "id": "3330e8c4-9fcf-11e7-9de9-74f76c400a22",
    "created_at": "Fri Sep 22 19:50:29 UTC 2017",
    "title": "Senior Frontend Software Engineer",
    "location": "Renton, WA",
    "type": "Full Time",
    "description": "<p>The Digital Innovation Group (DIG) at Providence Health &amp; Services is a small but mighty product development and incubation team that is building next-gen tools that give patients convenient and easy access to healthcare virtually anywhere, anytime.</p>\n\n<p>We are looking for a Senior Frontend Software Engineer that will help us transform healthcare through technology that is smart, sophisticated, user-centric, and measurable. Your work will change healthcare as we know it. You will be building the software that powers the consumer healthcare experience for patients both in and outside of our hospital network. If you want to solve complex problems that make a clear and real-world impact in people’s lives, join us!</p>\n\n<p>In order to transform healthcare, we need individuals who love cutting edge technologies. We run through the green fields, and take calculated risks. We learn from our successes and failures, while respecting each other and our organizations mission (Know me, Care for Me, Ease My Way).</p>\n\n<p>We need your skills to make this transformation! We’re looking for developers who have passion for learning and working with new technologies. This Sr. Software Engineer will:</p>\n\n<ul>\n<li>Work with customers, designers and UX experts to design and develop solutions to challenging problems, leading teams and mentoring more junior engineers.</li>\n<li>Design fault-tolerant architecture that scales with real-time workloads involving audio, video, data, and messaging.</li>\n<li>Provide thought leadership through investigating new technologies and how they can be applied.</li>\n<li>Take calculated risks, learn from success or failure, and apply that to the next problem in the pipeline.</li>\n</ul><p>Qualifications:</p>\n\n<ul>\n<li>Bachelor’s degree in Computer Science or equivalent combination of education and relevant experience.</li>\n<li>6 years working with web server architecture and tuning for performance and scalability</li>\n<li>6 years of “Mobile First”, Responsive Design with HTML and CSS.</li>\n<li>6 years of object oriented design and implementation.</li>\n<li>2 years of React</li>\n<li>2 years of Node.js, Angular.js, and Java and/or C# preferred</li>\n<li>A passion for continuous delivery and test-first design. Experience deploying to cloud-native infrastructure using containers is an asset.</li>\n<li>A demonstrated track record of being a change agent, leaving every team and process better than you found it.</li>\n</ul><p>We Offer:</p>\n\n<ul>\n<li>A small but growing team - we’re good at what we do and enjoy working together.</li>\n<li>Autonomy and respect from day one.</li>\n<li>An environment that is scrappy, flexible, and values tenacity.</li>\n<li>Great pay.</li>\n<li>Generous vacation, benefits, flexible work, and matched 403b.</li>\n<li>The best tools money can buy.</li>\n<li>Excellent career growth opportunities.</li>\n</ul><p>What Else:\nYou’ll be surrounded by a team of people who have transformed industries and have come to Providence to transform health care delivery. You will have the best of both worlds- the exhilaration of an incubation organization paired with the resources and security of an industry healthcare leader.</p>\n\n<p>Our Mission:\nAs employees of the Providence Digital Innovation Group, we passionately serve the people of our community. We are dedicated to removing obstacles that limit access to quality health care and enabling people to live healthier lives.</p>\n\n<p>We offer a full comprehensive range of benefits - see our website for details\n<a href=\"http://www.providenceiscalling.jobs/rewards-benefits/index.html\">http://www.providenceiscalling.jobs/rewards-benefits/index.html</a></p>\n\n<p>About Us\nProvidence Health &amp; Services is the third largest not-for-profit health system in the United States. Providence employs more than 76,000 caregivers (employees) across a five-state area; AK, WA, MT, OR, and CA. Our facilities include 34 hospitals, 475 physician clinics, senior services, supportive housing and other health and educational services. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.</p>\n\n<p>Answer the call.  Providenceiscalling.jobs\nWhen applying online, please reference job number 160599.</p>\n\n<p>Apply online:\n<a href=\"http://50.73.55.13/counter.php?id=110124\">http://50.73.55.13/counter.php?id=110124</a></p>\n\n<p>Providence Health &amp; Services is an equal opportunity employer who provides competitive benefits, a drug-free workplace and supports work/life balance.</p>",
    "how_to_apply": "<p>Answer the call.  Providenceiscalling.jobs\nWhen applying online, please reference job number 160599.</p>\n\n<p>Apply online:\n<a href=\"http://50.73.55.13/counter.php?id=110124\">http://50.73.55.13/counter.php?id=110124</a></p>",
    "company": "Providence Health & Services",
    "company_url": "http://www.providence.org",
    "company_logo": "http://github-jobs.s3.amazonaws.com/28266b5c-9fcf-11e7-9fdd-805000456ade.jpg",
    "url": "http://jobs.github.com/positions/3330e8c4-9fcf-11e7-9de9-74f76c400a22"
  },
  {
    "id": "5d01bc7e-9f74-11e7-8538-c08a4b57cc9b",
    "created_at": "Fri Sep 22 16:00:25 UTC 2017",
    "title": "C# / .Net Software Developer (f/m)",
    "location": "Berlin, Germany",
    "type": "Full Time",
    "description": "<p>The Chal-Tec Corporation is an international commercial enterprise for consumer electronics, event technology, and musical instruments. With more than 300 employees located in Germany and Asia we are among the leading merchants within the electronics sector. Our trading platform <a href=\"http://www.electronic-star.de\">www.electronic-star.de</a> - is a renowned and established brand, well known for innovative products and excellent customer support in 21 countries. We are a freshly innovative E-Commerce business with ambitious goals. Customer satisfaction is of major importance. This is why we are searching for motivated colleagues who will help us make our ideas and visions become reality.</p>\n\n<p>Awaiting you is a relaxed startup-style working environment coupled with a thoughtful business organization, exciting development projects implemented by an open-minded and professional team that is passionate about its cause. The IT department is currently 24 staff members strong, and programs the shopping platforms of electronic-star, klarstein, auna and capital sports in addition to\nmuch of the in-house software and services used by the company. The goal is for all of our in-house brand online shops to develop in cooperation with the brand management, graphic and marketing departments.</p>\n\n<p>Our continuous growth and constant profitability promise long-term stability and career development possibilities.</p>\n\n<p>What you can expect</p>\n\n<pre><code>Work closely with the departments on successful implementation in project-based teams\nPut your knowledge toward existing solutions based on ASP.NET, C # and VB.Net to make them even more stable and to keep performance strong\nUse various API connections in the form of REST, SOAP or XML to provide international marketplaces throughout Europe with data and to deal in real-time e-commerce\nUse the direct database connection and interaction with the ERP system to your benefit\nTest your knowledge and procedures in documentation and workflow charts available to your team\n</code></pre>\n\n<p>Your day-to-day work</p>\n\n<pre><code>A good mix of different software development fields working on our shops in more than 15 countries\nWith 13 brands in over 50 stores, there is something for every taste\nCollaboration with a variety of marketplaces provide each project with its own unique expression and thus varied software development\nReporting and communication with the relevant departments is quickly and easily maintained in JIRA\nSprint planning is done with the teams, and you will be regularly asked for your own assessment with regard to expenses and problem solving\n</code></pre>\n\n<p>Your profile</p>\n\n<pre><code>You have a degree in computer science (or equivalent qualification) and several years of experience in a similar position\nWorking with Visual Studio 2015, Git Flow and SQL Management Studio is second nature\nASP.NET, C #, VB.Net, MVC, JavaScript, HTML and CSS comprise your world of software development\nSELECT, INSERT and UPDATE make your fingers itch to write more (T) SQL\nYou already have active experience working in an agile environment with SCRUM or Kanban methods\nYou are a team player and always want to personally deliver flawless source code\nFluent German and good English skills at work, both spoken and written, are a must\n</code></pre>\n\n<p>What we offer</p>\n\n<pre><code>Varied and challenging tasks with a high level of responsibility\nSocial services such as company pension\nDevelopment and training opportunities\nOpen corporate culture with flat hierarchies and short decision paths\nFlexible working hours, a top equipped workplace in a modern loft office in central Berlin (Spittelmarkt)\n</code></pre>",
    "how_to_apply": "<p>Email your CV to <a href=\"mailto:s.vogel@chal-tec.com\">s.vogel@chal-tec.com</a>\nor Apply directly <a href=\"https://chal-tec-gmbh.softgarden.io/applications/9305498c-904c-4e8b-8813-f0d3bbb65842?1&amp;isEditMode=false&amp;l=de\">https://chal-tec-gmbh.softgarden.io/applications/9305498c-904c-4e8b-8813-f0d3bbb65842?1&amp;isEditMode=false&amp;l=de</a></p>",
    "company": "Chal-Tec GmbH",
    "company_url": "http://chal-tec.com/?lang=en#1",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/5d01bc7e-9f74-11e7-8538-c08a4b57cc9b"
  },
  {
    "id": "3557578a-9f9f-11e7-83a1-87df9f26ebb2",
    "created_at": "Fri Sep 22 15:09:10 UTC 2017",
    "title": "SENIOR JAVASCRIPT / NODEJS DEVELOPER",
    "location": "Prague, CZ",
    "type": "Full Time",
    "description": "<p>Cimpress is one of those companies you might have never heard of, but if you look around, you’ll find our products on almost every corner. When you see a business card, customized t-shirt, mug, poster, photo album or engraved pen, there is a high chance that they actually came from one of our facilities.</p>\n\n<p>We are disrupting a multi-billion-dollar business by using the newest technologies to run our manufacturing facilities. Our job in Prague is to (in cooperation with our colleagues from Switzerland and U.S) help direct millions of orders from all around the world to the best (closest, cheapest, highest-quality) factory that can produce it, as well write software that will support all of the processes ranging from ordering the product till it’s successful delivery to the customers door.</p>\n\n<p>In our high-volume business, we need to be smart about our choice of technology as well as our algorithms and architecture.</p>\n\n<p><strong>At the moment, our most commonly used technologies are:</strong></p>\n\n<ul>\n<li>React and Vue on the client and micro-service architecture using mostly Node.js</li>\n<li>AWS</li>\n<li>Relational and NoSQL databases</li>\n<li>GIT</li>\n<li>Docker</li>\n</ul><p>… and the list could go on. We trust our engineers to make good team decisions about their technology and we let them pick the tools that make the most sense for the problem they are solving. This helps us keep our software up to date with the newest technologies (because developers love to play with new stuff J ) but at the same time we are choosing long-term solutions over the short-term hypes (because developers hate rewriting everything from scratch again and again J )</p>\n\n<p><strong>Some challenges you will be faced with:</strong></p>\n\n<ul>\n<li>Figuring out, how to model your services in a very diverse environment</li>\n<li>Creating algorithms for matching orders to equipment that needs to be used to produce them</li>\n<li>Maintaining high availability of your services</li>\n<li>Figuring out how to build user friendly UIs in which the customers can manage their complex factory setup</li>\n</ul><p><strong>How we operate:</strong></p>\n\n<p>Although we are a big company spread around multiple continents, our teams have almost a start-up feel. The squads are autonomous, which means that they are deciding on their technology, tasks and deadlines, as well as the way they want to work together (Kanban, Scrum …). On the other hand they are expected to make informed decisions, use common sense and be responsible towards delivering useful software.</p>\n\n<p><strong>What we can offer you:</strong></p>\n\n<ul>\n<li>Very competitive pay</li>\n<li>Work with interesting technologies</li>\n<li>Possibility to grow professionally</li>\n<li>Freedom to architect and implement your own solutions</li>\n<li>Generous benefits package</li>\n<li>Exciting projects that have global impact</li>\n<li>Most challenging environment you will probably see in the industry</li>\n<li>Travel expenses</li>\n<li>Possibility to travel to our factories and offices all around the world</li>\n</ul><p><strong>What we expect from you:</strong></p>\n\n<ul>\n<li>Passion for learning and trying new things</li>\n<li>Either Frontend (React, Vue, Angular) or Backend (NodeJs ES6/ES7) experience*</li>\n<li>Microservice architecture experience</li>\n<li>Knowledge how rest works</li>\n<li>Prior experience with AWS</li>\n</ul><p><em>Although we are looking for somebody with prior experience with Javascript/NodeJS, when we see motivated people who want to learn and grow, we are willing to close one eye and help them get up to speed (some of our best people came from Java, C# and PHP environments and after a short while, they were doing just fine J)</em></p>",
    "how_to_apply": "<p><a href=\"mailto:dwood@cimpress.com\">dwood@cimpress.com</a></p>",
    "company": "Cimpress Technology",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/2c075b26-9f9f-11e7-92d1-07d77cc754de.png",
    "url": "http://jobs.github.com/positions/3557578a-9f9f-11e7-83a1-87df9f26ebb2"
  },
  {
    "id": "861bdad4-9f85-11e7-8486-8dee8a35b27d",
    "created_at": "Fri Sep 22 11:05:06 UTC 2017",
    "title": "Software Developer",
    "location": "London",
    "type": "Full Time",
    "description": "<p>We’re looking for a Software Developer at Made by Many to make digital products in a uniquely collaborative way that brings technology, culture and people together to drive big change. We work with some of the world's most forward-looking organisations such as the V&amp;A, Nike, Finnair, Expedia and the World Economic Forum to build best-in-class digital experiences and help to change our clients for the better.</p>\n\n<h2>The role</h2>\n\n<p>We prefer the term Software Developer to Full-Stack or Engineer because we feel it’s a more accurate and open description of someone interested in tackling different types of development tasks and project types.</p>\n\n<p>As a Software Developer at Made by Many you will be an equal partner throughout the product development process alongside designers, strategists and product managers. You will collaborate from the very earliest stages of a project, through delivery to market and beyond, using your experience in technology to create opportunities and solve problems.</p>\n\n<p>You are well versed in either React/React Native or Elixir (or both) and open to mastering these tools and more. You’re someone who loves getting their hands dirty implementing features and tests and can work to a high standard on production code or work quickly to deliver a prototype or proof of concept.</p>\n\n<h2>Salary and benefits</h2>\n\n<p>The salary for this position is £35,000–£50,000 depending on experience. We offer 25 days holiday a year, a company pension, private healthcare and a company mobile phone.</p>\n\n<h2>We’re looking for someone who</h2>\n\n<ul>\n<li>Has shipped production web projects using Elixir/Phoenix, Ruby on Rails or any other modern programming language/framework</li>\n<li>Has experience in modern front-end technologies including React and ES6 and can put them to use for mobile development using tools like React Native</li>\n<li>Has experience with Elixir/Phoenix or is interested in learning</li>\n</ul><h2>Amongst other things, your job will involve</h2>\n\n<ul>\n<li>Building web, mobile and physical connected products at different stages of evolution — quick proof of concepts, in-depth prototypes and scalable production projects</li>\n<li>Closely collaborating with the rest of the product team — product managers, designers and strategists — both from Made by Many and the clients we work with</li>\n</ul><h2>Our default technology stack</h2>\n\n<p>We have a common set of tools and languages that we tend to work with (though are always open to using the most appropriate technology for a given task). You won’t be expected to know all of these on day one, but proficiency in either React or Elixir will be required.</p>\n\n<ul>\n<li>React</li>\n<li>React Native</li>\n<li>ES6</li>\n<li>Sass</li>\n<li>Elixir + Phoenix</li>\n<li>Terraform</li>\n<li>AWS</li>\n</ul>",
    "how_to_apply": "<p><a href=\"https://www.beapplied.com/apply/rfjIK8R2Ct\">https://www.beapplied.com/apply/rfjIK8R2Ct</a> </p>\n\n<p>We're using Be Applied to improve the recruitment process and reduce bias. This means it might feel different from other job applications, but bear with us - your engagement with the Equal Opportunities form tells us if we’re successfully reaching a diverse pool of jobseekers. And your answers to the questions we ask are your opportunity to demonstrate how you think and how well-matched you are to the role. It’s always worth going the extra mile.</p>",
    "company": "Made by Many",
    "company_url": "https://www.madebymany.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/64d5e3b0-9f85-11e7-8367-a91712b59ef0.png",
    "url": "http://jobs.github.com/positions/861bdad4-9f85-11e7-8486-8dee8a35b27d"
  },
  {
    "id": "2d3fbb04-9f78-11e7-85a5-84085faf06f8",
    "created_at": "Fri Sep 22 09:29:00 UTC 2017",
    "title": "Fullstackutvecklare för uppbyggnad av Protector Försäkrings nya utvecklingsavdelning",
    "location": "Stockholm",
    "type": "Full Time",
    "description": "<p>Har du några års erfarenhet av systemutveckling i Java och vill nu vara med i uppbyggnaden av något nytt? Norska försäkringsbolaget Protector växer med 40 % i år och ska nu starta upp utvecklingsavdelning även i Sverige! Du kommer att ingå i teamet av utvecklare som sitter i Oslo, men du och ytterligare en erfaren kollega kommer att vara nyckelpersoner för byggandet av den nya avdelningen i Stockholm. Är det dig vi söker?</p>\n\n<p><b> OM TJÄNSTEN </b></p>\n\n<p>Academic Work söker för Protectors räkning en fullstackutvecklare till ett nytt utvecklingsteam i Stockholm. I Stockholm började den första utvecklaren i våras och nu söker man en ytterligare person att bygga teamet med. Protector är ett norskt försäkringsbolag som efter bara fem år i Sverige redan omsätter nästan en miljard kronor. I år är expansionen 40 % vilket ställer höga krav på de tekniska lösningarna och IT är högt prioriterat på företaget. Teamet i Stockholm kommer att ingå i utvecklingsavdelningen i Oslo där det idag arbetar 14 Javautvecklare uppdelade i tre mindre team.</p>\n\n<p>Den här rekryteringsprocessen hanteras av Academic Work och önskemål är att alla samtal och mail kring tjänsten går till Academic Work</p>\n\n<p>Tjänsten är en direktrekrytering vilket innebär att rekryteringsprocessen sker genom Academic Work men du kommer anställas direkt hos Protector.</p>\n\n<p><b> ARBETSUPPGIFTER </b></p>\n\n<p>Som fullstackutvecklare kommer du att vara en nyckelspelare i arbetet med att bygga upp IT-avdelningen i Stockholm. Du kommer att arbeta tätt tillsammans med din utvecklarkollega i Stockholm men också utvecklingsavdelningen i Oslo där du kommer att tillhöra det team som utvecklar system för dokumenthantering kring försäkringsavtal, fakturor och liknande. Teamet idag består av fem personer. Utvecklingsarbetet på Protector sker agilt och eftersom de flesta system på företaget utvecklas inhouse kommer du att arbeta med både förvaltning, vidareutveckling och nyutveckling.</p>\n\n<p>Teknikstacken ser ut som följande:</p>\n\n<ul>\n<li><p>Serversida: Java, Tomcat, Spring Boot, Node.js, Gradle, REST</p></li>\n<li><p>Klient: Angular.js, System.js, JSP, Twitter Bootstrap, Aurelia</p></li>\n<li><p>Verktyg: GIT (Bitbucket), JIRA, TeamCity, SonarQube, Ansible, Docker</p></li>\n</ul><p>Du kommer till exempel att:</p>\n\n<ul>\n<li><p>Arbeta med systemutveckling i hela teknikstacken men primärt i Java</p></li>\n<li><p>Ha kontakt med verksamheten för att undersöka behov av tekniska funktioner och systemlösningar</p></li>\n<li><p>Samarbeta med övriga utvecklingsteamet</p></li>\n</ul><p>Tjänsten passar dig som har arbetat några år med systemutveckling och nu vill vara med i uppbyggnaden av något nytt! Är du en vass utvecklare som vill bilda par med en annan erfaren duktig utvecklare och tillsammans bygga upp den nya utvecklingsavdelningen på ett företag i framkant inom sin bransch är det hit du ska söka dig! IT är ett mycket prioriterat område på Protector och det satsas mycket pengar i projekt och i nya systemlösningar.</p>\n\n<p><b> VI SÖKER DIG SOM </b></p>\n\n<ul>\n<li><p>Har arbetat minst 2-3 år med systemutveckling i Java i en agil miljö</p></li>\n<li><p>Har en slutförd akademisk utbildning inom exempelvis systemutveckling, datateknik eller liknande</p></li>\n<li><p>Har ett stort tekniskt intresse och intresse för nya teknologier</p></li>\n<li><p>Vill arbeta i hela teknikstacken</p></li>\n<li><p>Har mycket goda kunskaper i både svenska och engelska i tal och skrift eftersom du kommer att arbeta på båda språken</p></li>\n<li><p>Stor vikt kommer också att läggas vid dina personliga egenskaper och intresse för tjänsten och för Protector som företag.</p></li>\n</ul><p>Det är meriterande om du</p>\n\n<ul>\n<li>Har kunskaper i norska och/eller danska</li>\n</ul><p>Som person är du problemlösande och analytisk och ser positivt på utmaningar, tar egna initiativ att lösa dem och har ett systematiskt sätt att lösa dessa. Du har en personlig mognad och är trygg i dig själv. Du är mycket kvalitetsmedveten och strukturerad i ditt arbete, tar ansvar för arbetsuppgifter och säkerställer att uppgifter blir gjorda. Eftersom du kommer att ha många samarbeten internt krävs det att du har en god samarbetsförmåga och är lyhörd för andras tankar och åsikter. I rollen kommer du även att ha tät kontakt med verksamheten och vi förutsätter att du har ett affärsmässigt tänk.</p>\n\n<p><b> ÖVRIG INFORMATION </b></p>\n\n<ul>\n<li><p>Start: Enligt överenskommelse</p></li>\n<li><p>Omfattning: Heltid</p></li>\n<li><p>Lön: Månadslön enligt överenskommelse</p></li>\n<li><p>Placering: Invid Kungsträdgården, centrala Stockholm</p></li>\n<li><p>Kontaktuppgifter: Amanda Axelsson, Rekryteringsadministratör, <a href=\"mailto:amanda.axelsson@academicwork.se\">amanda.axelsson@academicwork.se</a></p></li>\n<li><p>Sök tjänsten genom att följa länken under \"How to Apply\". Vi går igenom urvalet löpande och annonsen kan stängas ner innan tjänsten är tillsatt om vi gått över till urvals och intervjufasen.</p></li>\n<li><p>Vi tar inte emot ansökningar via mail men har du specifika frågor kring tjänsten besvaras dessa på <a href=\"mailto:recruitmentstockholmsouth@academicwork.se\">recruitmentstockholmsouth@academicwork.se</a> under kontorstid. Skriv annonstiteln i rubriken och kopiera gärna in länken till annonsen i ditt mail. För generella funderingar kring din ansökan/vår rekryteringsprocess finns vi ofta tillgängliga i chatten på vår webb under vardagar så hör gärna av dig där!</p></li>\n</ul><p>Academic Work är Home of the Young Professionals. Vi vänder oss till dig som är akademiker och fortfarande studerar på högskola/universitet, är nyutexaminerad eller har några års arbetslivserfarenhet. Hos oss kan du arbeta som uthyrd konsult på specifika kunduppdrag eller bli anställd direkt hos ett kundföretag via vår rekryteringsverksamhet. Läs mer på <a href=\"http://www.academicwork.se\">www.academicwork.se</a>.</p>\n\n<p>SKYDD FÖR DEN PERSONLIGA INTEGRITETEN När du skickar in din ansökan till Academic Work godkänner och samtycker du till att Academic Work behandlar dina personuppgifter enligt Personuppgiftslagen. Läs mer under vår PuL-sida: <a href=\"https://www.academicwork.se/pul\">https://www.academicwork.se/pul</a></p>\n\n<p><b> INFORMATION OM FÖRETAGET </b></p>\n\n<p>Protector Försäkring etablerades i Norge år 2004 och har på kort tid lyckats få en stor marknadsandel. Protectors framgång bygger på unika relationer till samarbetspartners i form av försäkringsförmedlare och försäkringsmäklare samt ett dagligt fokus på kostnads- och kvalitetsledarskap. I dagsläget förvaltar Protector Försäkring en portfölj på nära 1 miljard kronor. Den svenska verksamheten går mycket bra och man startar nu upp en utvecklingsavdelning på kontoret i Stockholm!</p>\n\n<p>Efter fem år på den svenska marknaden är Protector försäkringsgivare åt</p>\n\n<p>Stora industri-, tjänste-, och fastighetsföretag, varav många är börsnoterade</p>\n\n<p>Små- och medelstora företag genom affinitylösningar och</p>\n\n<p>199 av Sveriges 290 kommuner samt ett antal landsting plus</p>\n\n<p>50 % av Sveriges bussar.</p>\n\n<p>Protector är utmanaren och söker medarbetare som delar Protectors värderingar – Trovärdig, Tillmötesgående, Modig och Engagerad.</p>",
    "how_to_apply": "<p>Ansök här: \n<a href=\"https://www.academicwork.se/annons/fullstackutvecklare-for-uppbyggnad-av-protector-forsakrings-nya-utvecklingsavdelning/14993686\">https://www.academicwork.se/annons/fullstackutvecklare-for-uppbyggnad-av-protector-forsakrings-nya-utvecklingsavdelning/14993686</a></p>",
    "company": "Protector Försäkring",
    "company_url": "https://www.protector.se/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/fbd4c9ba-9f77-11e7-8fae-de88baefa3d2.jpg",
    "url": "http://jobs.github.com/positions/2d3fbb04-9f78-11e7-85a5-84085faf06f8"
  },
  {
    "id": "30ba69fc-9f76-11e7-86ef-6b0e97e323bb",
    "created_at": "Fri Sep 22 09:14:50 UTC 2017",
    "title": "Front End Developer to Infor",
    "location": "Linköping",
    "type": "Full Time",
    "description": "<p>Are you a Front End Developer with knowledge in HTML, CSS, Javascript? Do you want to be challenged together with an ambitious and competent team that constantly strives to develop new innovative and smart solutions for Infor’s customers? Infor is looking for passionated developers for their User Productivity team in Linköping. Could that person be you?</p>\n\n<p><b> ABOUT THE ROLE </b></p>\n\n<p>Academic Work is on behalf of our client Infor looking for a Front End Developer. As a developer at Infor, there are great opportunities to develop and grow among different areas based on your interests. Here you get the chance to be challenged on a daily basis where your creativity and your ideas are rewarded. The User Productivity team values collaboration and knowledge sharing to constantly develop and build new functionality using ground-breaking technology. The team works in an agile form according to SCRUM and you will work closely with your colleagues in both Linköping and Prague.</p>\n\n<p>This recruitment process is conducted by Academic Work and the request from Infor is that all questions regarding the position is handled by <a href=\"mailto:lin01@academicwork.se\">Academic Work</a>.</p>\n\n<p>Academic Work is responsible for the recruitment process but the candidate that proceed will be employed directly by Infor.</p>\n\n<p><b> JOB DUTIES </b></p>\n\n<p>On a daily basis you’ll be challenged, and rewarded for coming up with amazing solutions. Most of your days will be spent building out new features on one of 2 different products. One is an amazing meta application that allows consultants to build applications on top of our existing api’s using a WSIWYG editor. You can drag data grids onto a page, plug a data source into it, and watch it fill with data. The other application is a high performance document management system that is used by almost all the other ERP’s at Infor. The tech stacks are Angular and AngularJSon top of Java backends with MS SQL and PostgreSQL databases. For our Cloud based offering Infor have a partnership with Amazon and utilize lots of their services as well as hosts in the Amazon Cloud.</p>\n\n<p>For example, you will work with:</p>\n\n<ul>\n<li><p>Angular 1.6 or Angular 4</p></li>\n<li><p>Building new features using best practices.</p></li>\n<li><p>Debugging issues that come up, and making intelligent choices about solutions.</p></li>\n<li><p>Documenting code that you write.</p></li>\n<li><p>Unit Testing code that you write.</p></li>\n</ul><p><b> WE ARE LOOKING FOR </b></p>\n\n<ul>\n<li><p>Relevant education for the job, for example Computer Science degree.</p></li>\n<li><p>Professional experience and knowledge in Javascript, HTML and CSS.</p></li>\n<li><p>Experience with one Javascript front end framework, Angular/React/Cycle/Aurelia</p></li>\n<li><p>Genuine interest in and passion for programming and problem solving.</p></li>\n<li><p>Strong English skills.</p></li>\n</ul><p>You are a person who likes to take responsibility and prefer to work in a team environment with both experienced and less experienced colleagues. You love problem solvning and set high goals for yourself. Furthermore, we also see that you have a customer-focused approach to create user-friendly and flexible solutions for Infors customers.</p>\n\n<p><b> OTHER INFORMATION </b></p>\n\n<ul>\n<li><p>START: By agreement</p></li>\n<li><p>WORK EXTENT: Full-time</p></li>\n<li><p>LOCATION: Linköping, Sweden</p></li>\n<li><p>CONTACT; Recruitment consultant Anna Johansson</p></li>\n<li><p>Do you meet the requirements? See link below \"How to apply\" and submit your application as soon as possible as our selection process is continuous.</p></li>\n</ul><p>We only handle applications through our website but if you have questions about the position you are welcome to email us <a href=\"mailto:lin01@academicwork.se\">lin01@academicwork.se</a> and we will answer during office hours. Please write the advert title in the subject and paste the advert link in the mail.</p>\n\n<p>We are Home of the Young Professionals. We offer jobs for students or those who have completed their studies and have up to five years of work experience. With us, you can work as a consultant on specific client assignments or you can become employed directly by one of our customer companies through our recruitment service. Find out more on our web site <a href=\"http://www.academicwork.se\">www.academicwork.se</a>.</p>\n\n<p>PROTECTION OF PRIVACY: When sending your application to Academic Work you approve and agree on Academic Work handling your personal information according to Personal Data Act. For more information read about PUL (only available in Swedish).</p>\n\n<p><b> INFORMATION ABOUT THE COMPANY </b></p>\n\n<p>Infor is the third largest provider of enterprise applications and services, helping 70,000 customers in 194 countries improve operations, drive growth and quickly adapt to changes in business demands. Infor offers deep industry-specific applications and suites, engineered for speed, using ground-breaking technology that delivers a rich user experience and flexible deployment options that give customers a choice to run their businesses in the cloud, on-premises or both. For additional information, visit <a href=\"http://www.infor.com\">www.infor.com</a>.</p>",
    "how_to_apply": "<p>Apply here:\n<a href=\"https://www.academicwork.se/annons/front-end-developer-to-infor/14994018\">https://www.academicwork.se/annons/front-end-developer-to-infor/14994018</a></p>",
    "company": "Infor",
    "company_url": "http://www.infor.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/13d9d214-9f76-11e7-81cb-2bcbb535d60c.png",
    "url": "http://jobs.github.com/positions/30ba69fc-9f76-11e7-86ef-6b0e97e323bb"
  },
  {
    "id": "4c7b6ada-9f74-11e7-886f-4b90b690449e",
    "created_at": "Fri Sep 22 09:00:30 UTC 2017",
    "title": "Back End Developer to Infor",
    "location": "Linköping",
    "type": "Full Time",
    "description": "<p>Are you a Back End Developer with strong Java programming skills? Do you want to be challenged together with an ambitious and competent team that constantly strives to develop new innovative and smart solutions for Infor's customers? Infor is looking for passionated developers for their User Productivity team in Linköping. Could that person be you?</p>\n\n<p><b> ABOUT THE ROLE </b></p>\n\n<p>Academic Work is on behalf of our client Infor looking for a Back End Developer. As a developer at Infor, there are great opportunities to develop and grow among different areas based on your interests. Here you get the chance to be challenged on a daily basis where your creativity and your ideas are rewarded. The User Productivity team values collaboration and knowledge sharing to constantly develop and build new functionality using ground-breaking technology. The team works in an agile form according to SCRUM and you will work closely with your colleagues in both Linköping and Prague.</p>\n\n<p>This recruitment process is conducted by Academic Work and the request from Infor is that all questions regarding the position is handled by <a href=\"mailto:lin01@academicwork.se\">Academic Work</a>.</p>\n\n<p>Academic Work is responsible for the recruitment process but the candidate that proceed will be employed directly by Infor.</p>\n\n<p><b> JOB DUTIES </b></p>\n\n<p>On a daily basis you’ll be challenged, and rewarded for coming up with amazing solutions. Most of your days will be spent building out new features on one of 2 different products. One is an amazing meta application that allows consultants to build applications on top of our existing api’s using a WSIWYG editor. You can drag data grids onto a page, plug a data source into it, and watch it fill with data. The other application is a high performance document management system that is used by almost all the other ERP’s at Infor. The tech stacks are Angular 1.6, 2, and 4 on top of Java backends with MS SQL and PostgreSQL databases. For our Cloud based offering Infor have a partnership with Amazon and utilize lots of their services as well as hosts in the Amazon Cloud.</p>\n\n<p>For example, you will work with:</p>\n\n<ul>\n<li><p>Java 8 (soon 9)</p></li>\n<li><p>Building new features using best practices.</p></li>\n<li><p>Debugging issues that come up, and making intelligent choices about solutions.</p></li>\n<li><p>Documenting code that you write.</p></li>\n<li><p>Unit Testing code that you write.</p></li>\n</ul><p><b> WE ARE LOOKING FOR </b></p>\n\n<ul>\n<li><p>Relevant education for the job, for example Computer Science degree.</p></li>\n<li><p>Professional experience with Java development.</p></li>\n<li><p>Genuine interest in and passion for programming and problem solving.</p></li>\n<li><p>Strong English skills.</p></li>\n</ul><p>You are a person who likes to take responsibility and prefer to work in a team environment with both experienced and less experienced colleagues. You love problem solvning and set high goals for yourself. Furthermore, we also see that you have a customer-focused approach to create user-friendly and flexible solutions for Infors customers.</p>\n\n<p><b> OTHER INFORMATION </b></p>\n\n<ul>\n<li><p>START: By agreement</p></li>\n<li><p>WORK EXTENT: Full-time</p></li>\n<li><p>LOCATION: Linköping, Sweden</p></li>\n<li><p>CONTACT: Recruitment consultant Anna Johansson</p></li>\n<li><p>Do you meet the requirements? Follow the link below \"How to Apply” and submit your application as soon as possible as our selection process is continuous.</p></li>\n</ul><p>We only handle applications through our website but if you have questions about the position you are welcome to email us <a href=\"mailto:lin01@academicwork.se\">lin01@academicwork.se</a> and we will answer during office hours. Please write the advert title in the subject and paste the advert link in the mail.</p>\n\n<p>We are Home of the Young Professionals. We offer jobs for students or those who have completed their studies and have up to five years of work experience. With us, you can work as a consultant on specific client assignments or you can become employed directly by one of our customer companies through our recruitment service. Find out more on our web site <a href=\"http://www.academicwork.se\">www.academicwork.se</a>.</p>\n\n<p>PROTECTION OF PRIVACY: When sending your application to Academic Work you approve and agree on Academic Work handling your personal information according to Personal Data Act. For more information read about PUL (only available in Swedish): <a href=\"https://www.academicwork.se/pul\">https://www.academicwork.se/pul</a></p>\n\n<p><b> INFORMATION ABOUT THE COMPANY </b></p>\n\n<p>Infor is the third largest provider of enterprise applications and services, helping 70,000 customers in 194 countries improve operations, drive growth and quickly adapt to changes in business demands. Infor offers deep industry-specific applications and suites, engineered for speed, using ground-breaking technology that delivers a rich user experience and flexible deployment options that give customers a choice to run their businesses in the cloud, on-premises or both. For additional information, visit <a href=\"http://www.infor.com\">www.infor.com</a>.</p>",
    "how_to_apply": "<p>Apply here: <a href=\"https://www.academicwork.se/annons/back-end-developer-to-infor/14994009\">https://www.academicwork.se/annons/back-end-developer-to-infor/14994009</a></p>",
    "company": "Infor",
    "company_url": "http://www.infor.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/31803170-9f74-11e7-9613-7092cba14dfc.png",
    "url": "http://jobs.github.com/positions/4c7b6ada-9f74-11e7-886f-4b90b690449e"
  },
  {
    "id": "6d1e31a6-9ee2-11e7-9424-55e8515a5a57",
    "created_at": "Thu Sep 21 15:36:12 UTC 2017",
    "title": "Senior Full Stack Javascript Developer",
    "location": "Chicago",
    "type": "Full Time",
    "description": "<p>Want to build apps for the world’s biggest companies? At Punchkick Interactive, we transform our clients into leaders of the mobile space. We do everything—from strategy, to design, to development—in-house in a highly collaborative atmosphere. We’re looking for experienced web developers who want to join our team and help us build beautiful, easy-to-use, cutting-edge websites and web apps.</p>\n\n<p>DESCRIPTION</p>\n\n<p>Come work with a team of ultra-talented and incredibly authentic designers, developers, strategists, UX architects, and tech visionaries. We build products that we’re incredibly proud of—for clients that we deeply respect—all within a team of great friends and colleagues. Punchkick Interactive has an unmistakeable culture of excellence and we seek out folks who feel alive and thrive in this type of environment.</p>\n\n<p>Punchkick has doubled in size each of the last three years, landed on the Inc. 5000, and was voted the best place to work in Chicago by the Chicago Business Journal. To date, Punchkick has worked with 18 of the Fortune 500. And we’ve only just begun to hit our stride.</p>\n\n<p>WHAT ARE WE LOOKING FOR?</p>\n\n<p>The JS developer position requires an energetic and proactive individual who will work as a key team member alongside other application developers and support staff. We want a decisive individual who possesses the skill set to manage multiple initiatives, spanning new software development projects as well as application maintenance and support.</p>\n\n<p>QUALIFICATIONS</p>\n\n<ul>\n<li>Minimum of 3 years development experience with both frontend and server-side JavaScript.</li>\n<li>Experience writing APIs or websites with server-side frameworks such as Express or hapi.</li>\n<li>Experience building with a variety of front-end JavaScript libraries and frameworks like Angular and React.</li>\n<li>Solid knowledge of ES2015 syntax, a working knowledge of module-based JavaScript development</li>\n<li>Experience writing clean, structured, CSS using preprocessors like Sass or Less.</li>\n<li>Familiarity working with Git version control in a collaborative team environment, creating pull requests and performing code reviews.</li>\n<li>Experience using automated build tools such as Webpack, continuous integration/deployment is a plus.</li>\n<li>Strong knowledge of relational databases and ability to write performant queries using SQL.</li>\n<li>Working knowledge of software design patterns, experience writing automated tests.</li>\n</ul><p>KEY RESPONSIBILITIES</p>\n\n<ul>\n<li>Leading architecture and development of web applications.</li>\n<li>Coordinating with strategy, internal and external stakeholders, and design during various project stages.</li>\n<li>Being a core contributor to codebases across many projects and clients.</li>\n<li>Working with cross-platform (native) team members to coordinate, and in some cases drive, feature functionality and implementation.</li>\n<li>Promote good team practices, such as regular code review and pair programming.</li>\n<li>Assisting the client support team using your technical background.</li>\n<li>Bring vision to the team in the form of new technology recommendations and approaches.</li>\n</ul><p>To apply for this role, email us at <a href=\"mailto:careers@punchkick.com\">careers@punchkick.com</a> with your resume, portfolio, and a short paragraph of why you’d be a perfect addition to our team.</p>",
    "how_to_apply": "<p>To apply for this role, email us at <a href=\"mailto:careers@punchkick.com\">careers@punchkick.com</a> with your resume, portfolio, and a short paragraph of why you’d be a perfect addition to our team.</p>",
    "company": "Punchkick Interactive",
    "company_url": "http://Punchkick Interactive",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/6d1e31a6-9ee2-11e7-9424-55e8515a5a57"
  },
  {
    "id": "dd7e5438-6e2e-11e7-99ad-5b625668a122",
    "created_at": "Thu Sep 21 14:47:11 UTC 2017",
    "title": "Java / C# Programmers Wanted!",
    "location": "Los Angeles, CA",
    "type": "Full Time",
    "description": "<p>We're looking for good programmers with an interest in web development.<br>\nIf you're smart and motivated, and you want to work in a supportive\nenvironment, then let's talk.</p>\n\n<p><strong>About Us</strong></p>\n\n<p>TechEmpower is a custom software company. We help our clients understand their \nneeds, plan solutions for them, and build software -- on time and on target.  By taking away their technical headaches, we help our clients succeed.  </p>\n\n<ul>\n<li><p>We're small.  We have 30 employees and we work in teams of 1-6.</p></li>\n<li><p>We're friendly.  Our office is professional and collegiate, \nlike a computer lab staffed by adults.  We help each other out.</p></li>\n<li><p>We're mostly a web shop.  We do a bit of desktop, and a bit of \nnative mobile, but 90% of our work is creating complex web applications.</p></li>\n<li><p>We work with a wide range of technologies (see Technologies below) but\nJava is first in our heart.  At this time we are only considering candidates with Java or C#.</p></li>\n<li><p>We're established.  We were founded way back in 1997, which means we've \ncontinued to grow despite the dot-com bomb, the great recession, \nand several hurricanes.</p></li>\n<li><p>We're the authority on web framework performance (<a href=\"https://twitter.com/hashtag/techempower\">https://twitter.com/hashtag/techempower</a>)</p></li>\n</ul><p><strong>About You</strong></p>\n\n<p>First and foremost, you're a good programmer.  You like to write code and design\nsoftware solutions.  You like to learn new languages, new APIs, and new\ntechnologies.  You like the freedom to do things the right way.  You're a good\ncommunicator and play well with others.</p>\n\n<p><strong>The Job</strong></p>\n\n<p>As a programmer, you'll be working on a team, headed by a tech lead, \nto design and implement code.  We don't do top-down design; everyone gets a say \nin how the software will work.  Teams work on one project at a time, and \nprojects run from 3 months to several years, but usually 3-6 months.  </p>\n\n<p>We like to keep our programmers programming, and follow a task-oriented process\ndesigned to minimize meetings and busywork.</p>\n\n<p><strong>The Interview Process</strong></p>\n\n<p>We review every application we get.  If your application shows promise, \nwe'll contact you for a brief telephone interview.  Yes, there will be a quiz,\nbut our main goal is to get to know you better.  If that goes well, you'll\nbe invited to a series of in-person interviews.  </p>\n\n<p>We are very selective.  We all participate in the hiring process\nbecause we care about who we work with.  So expect to meet a lot of us!</p>\n\n<p><strong>Work Samples</strong></p>\n\n<p>If you can, please provide a sample of your work.  Github links work best.<br>\nDon't be shy!  We need to see what you can do.  </p>\n\n<p>Preference will be shown to candidates with verifiable work samples.</p>\n\n<p><strong>Technology</strong></p>\n\n<p>The technologies we use vary over time with our mix of projects. Here is a snapshot of what we're using now:</p>\n\n<p>Languages: Java, JavaScript, Python, Go, C#, Ruby, PHP</p>\n\n<p>Tools: Git, Docker, Jenkins, Sonar, IntelliJ, Eclipse, Ant, Maven</p>\n\n<p>Web: Jersey, .NET Core, React, Django, Node.js, Go, Rails, Handlebars, Backbone, Ember, </p>\n\n<p>Angular, Knockout, Servlets, jQuery</p>\n\n<p>Mobile: iOS, Android, PhoneGap</p>\n\n<p>Hosting: AWS, Rackspace Cloud, Linux deployments</p>\n\n<p>Data Persistence: ORM (Hibernate, etc.), Postgres, MySQL, MS SQL Server, NoSQL (Redis, Riak, etc.)</p>\n\n<p>We don't expect new hires to have experience with all of these, but we do expect you'll learn more about them every day.</p>\n\n<p><strong>Apply</strong></p>\n\n<p>If this sounds like the kind of place you'd like to work, please apply!</p>",
    "how_to_apply": "<p>Please apply at <a href=\"https://jobs.techempower.com/github\">https://jobs.techempower.com/github</a></p>",
    "company": "TechEmpower, Inc",
    "company_url": "https://www.techempower.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/c854ca10-6e2e-11e7-88bd-ed2f205e854d.png",
    "url": "http://jobs.github.com/positions/dd7e5438-6e2e-11e7-99ad-5b625668a122"
  },
  {
    "id": "efac5d12-9e3f-11e7-8470-ae49c23f1ebd",
    "created_at": "Wed Sep 20 20:12:52 UTC 2017",
    "title": "Senior Full Stack Software Engineer Job",
    "location": "Boston, MA, US, 02210",
    "type": "Full Time",
    "description": "<p>View job and apply on the corporate career site <a href=\"https://jobs.sap.com/job/Boston-Senior-Full-Stack-Software-Engineer-Hybris-Boston-Job-MA-02108/345825501/?feedId=203001&amp;utm_source=github&amp;utm_campaign=sap_HybrisUS\">here</a>, or view all SAP Hybris jobs in Boston <a href=\"https://jobs.sap.com/search/?q=sap_hybrisUS&amp;locationsearch=&amp;utm_source=github&amp;utm_campaign=sap_HybrisUS\">here</a>.</p>\n\n<p>Responsibilities:</p>\n\n<p>·       Develop engaging web applications for e-Commerce Digital Marketing applications</p>\n\n<p>·       Recommend appropriate technologies and libraries to be used in the client side stack</p>\n\n<p>·       Staying abreast of the latest developments to bring continual improvement to engineering </p>\n\n<p>·       Embrace the Agile process, take ownership of your work; collaborate and be meticulous</p>\n\n<p>Requirements:</p>\n\n<p>·      At least 4 to 6 years’ experience developing complex web applications</p>\n\n<p>·      Highly skilled full stack engineer with exceptional OOP/MVC skills</p>\n\n<p>·      Skilled with Java, Angular, HTML5/CSS3/JS and exposure to other modern JS frameworks</p>\n\n<p>·      Experience working in a Continuous Integration and Delivery environment</p>\n\n<p>·      Excellent written and verbal communication skills</p>\n\n<p>View job and apply on the corporate career site <a href=\"https://jobs.sap.com/job/Boston-Senior-Full-Stack-Software-Engineer-Hybris-Boston-Job-MA-02108/345825501/?feedId=203001&amp;utm_source=github&amp;utm_campaign=sap_HybrisUS\">here</a>, or view all SAP Hybris jobs in Boston <a href=\"https://jobs.sap.com/search/?q=sap_hybrisUS&amp;locationsearch=&amp;utm_source=github&amp;utm_campaign=sap_HybrisUS\">here</a>.</p>",
    "how_to_apply": "<p>View job and apply on the corporate career site <a href=\"https://jobs.sap.com/job/Boston-Senior-Full-Stack-Software-Engineer-Hybris-Boston-Job-MA-02108/345825501/?feedId=203001&amp;utm_source=github&amp;utm_campaign=sap_HybrisUS\">here</a>, or view all SAP Hybris jobs in Boston <a href=\"https://jobs.sap.com/search/?q=sap_hybrisUS&amp;locationsearch=&amp;utm_source=github&amp;utm_campaign=sap_HybrisUS\">here</a>.</p>",
    "company": "SAP Hybris",
    "company_url": "https://jobs.sap.com/search/?q=sap_hybrisUS&locationsearch=&utm_source=github&utm_campaign=sap_HybrisUS",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d329c652-9e3f-11e7-9ae4-7b49164ca7bc.png",
    "url": "http://jobs.github.com/positions/efac5d12-9e3f-11e7-8470-ae49c23f1ebd"
  },
  {
    "id": "f1787932-9e30-11e7-8ae4-67f1d47e5292",
    "created_at": "Wed Sep 20 18:25:16 UTC 2017",
    "title": "Sr. Software Engineer - ReactJS",
    "location": "Seattle",
    "type": "Full Time",
    "description": "<p>LiveStories is a venture-backed company building modern tools to make civic data actionable and usable. Governments - world’s largest sector - depend on LiveStories to be more data-driven, transparent, and productive. Businesses, schools, and researchers depend on LiveStories to streamline their data operations. Our customers are located as far as Kenya or as close as Washington and California. </p>\n\n<p>You can find the latest coverage about LiveStories here: [<a href=\"https://www.livestories.com/news/\">https://www.livestories.com/news/</a>]</p>\n\n<p>We love data and believe in its power to transform how we live, work, and play. We obsess over simplifying access to data, so that anyone can gather insights. We look for people who can demonstrate versatility and creativity in working with data. If you obsess over changing the world, and are passionate about open data, cool data visualizations, data-driven business, high velocity sales, and Sim City, we would love to talk to you.</p>\n\n<h2>Job Description</h2>\n\n<p>As a senior developer on the LiveStories Team, you will work on building and refining core features of the LiveStories portfolio for civic data exploration, visualization and publishing. You will join a team of very passionate engineers who excel in turning apparently complex problems into an intuitive user experience, implemented in the most simple way. You will have the opportunity to work on customer-facing features, performance/scalability issues and building technical infrastructure. As a Senior Developer, you will mentor other engineers and help provide technical leadership for the team.</p>\n\n<h3>Qualifications</h3>\n\n<ul>\n<li>You are an experienced senior software developer with preferably 5+ years of experience, who thinks like an end user and knows that 90% done is only half done.</li>\n<li>You love beautiful, simple user interfaces, and you constantly wonder what you could have done to make your last project simpler.</li>\n<li>You understand why architectural patterns and API design are a must to build scalable, future-proof products.</li>\n<li>Ultimately, you want to be part of something big than software and make a durable change.</li>\n<li>You have a BS Degree in computer science with strong knowledge in CS fundamentals, algorithms &amp; data structures.</li>\n</ul><h3>Technologies you master:</h3>\n\n<ul>\n<li>ReactJS and Javascript inside out, Node.js, Postgres, Elasticsearch are a plus since we use them</li>\n<li>CSS, HTML</li>\n<li>Visualization and mapping packages such as D3js, Mapbox or others</li>\n<li>Deployment tools, such as Webpack and alike.</li>\n<li>Cloud infrastructure.</li>\n</ul><h3>Our benefits include:</h3>\n\n<ul>\n<li>Competitive, performance based compensation in a growing, disruptive startup</li>\n<li>Health, dental, and vision benefits </li>\n<li>Flexible vacation policy, including paid vacation</li>\n<li>3 day weekends </li>\n<li>An incredible team of diverse, smart, dedicated, and supportive people</li>\n</ul>",
    "how_to_apply": "<p><a href=\"http://smrtr.io/4QwNlQ\">http://smrtr.io/4QwNlQ</a></p>",
    "company": "LiveStories",
    "company_url": "https://www.livestories.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/6a8a2c7c-9e30-11e7-8581-ce8f7a7ea930.jpg",
    "url": "http://jobs.github.com/positions/f1787932-9e30-11e7-8ae4-67f1d47e5292"
  },
  {
    "id": "65796832-9e13-11e7-8970-d2715864603a",
    "created_at": "Wed Sep 20 14:53:54 UTC 2017",
    "title": "Backend Python Web Developer",
    "location": "Washington, DC",
    "type": "Full Time",
    "description": "<p>The Atlantic is a digital-first media company with over 150 years of history and 30 million online visitors a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC.</p>\n\n<p>Our tech stack includes: - Django - GitHub - Jenkins - NewRelic - Nginx - Percona - SCSS - Slack - uWSGI </p>\n\n<p>Who You Are</p>\n\n<p>We're looking for a developer who is passionate about clean code and great journalism to join our growing team for full-time on-site work. We welcome out-of-town applicants willing to relocate to the DC metro area but are currently unable to sponsor non-citizens unauthorized to work in the United States.</p>\n\n<p>Primary Responsibilities:</p>\n\n<p>Write well-documented and maintainable Python code\nMaintain and improve Ollie, our custom content management system and web platform built on the Django web framework\nFind and fix security vulnerabilities\nDiscover bottlenecks, optimize code or SQL queries to improve performance\nWork with our product team to implement and deploy new features to TheAtlantic.com and CityLab.com where they will be viewed by millions of people\nRequirements:</p>\n\n<p>Able to communicate well with both a technical or non-technical audience\nHas developed and deployed into production a non-trivial Django application\nHas written Python code on a team in a professional setting\nKnowledgeable about Python best practices including PEP8, unit testing, and documentation\nWhile not an HTML or CSS expert, is knowledgeable enough to make small front-end tweaks and changes as needed\nComfortable enough with Git to rebase without breaking into a sweat\nKnows SQL and is able to write a query in order to pull reports from a database\nFeels at ease performing routine tasks on the Linux command line (creating directories, changing permissions, etc)\nHow We Hire</p>\n\n<p>It starts with a resume, short cover letter, and a code sample – ideally a link to a profile on GitHub, BitBucket, or other service. If it looks like you are a fit, we'll schedule a phone interview to talk about the position, your work history, and talk through some technical questions. If we decide to move forward, we'll have you come into our office to meet the team.</p>\n\n<p>Benefits</p>\n\n<p>Employees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.</p>\n\n<p>Across Atlantic Media, generally, the firm looks for two “pillar gifts” in its candidates.  In all of us, these are more aspirational than actual, but they are central in our intentions.</p>\n\n<ol>\n<li><p>Force of Intellect - Atlantic Media seeks a discipline and rigor of thought as manifested, often, in exceptional academic performance and, later, success in a professional environment.</p></li>\n<li><p>Spirit of Generosity - Equally, Atlantic Media seeks what we term a spirit of generosity – a natural disposition towards service and selfless conduct.</p></li>\n</ol><p>Atlantic Media is an EOE of Minorities/Women/Vets/Disability.</p>",
    "how_to_apply": "<p>To apply please visit the link below:</p>\n\n<p><a href=\"http://atlanticmedia.applytojob.com/apply/7yGH9y/Backend-Python-Web-Developer?source=GitHub\">http://atlanticmedia.applytojob.com/apply/7yGH9y/Backend-Python-Web-Developer?source=GitHub</a></p>",
    "company": "The Atlantic",
    "company_url": null,
    "company_logo": null,
    "url": "http://jobs.github.com/positions/65796832-9e13-11e7-8970-d2715864603a"
  }
]